# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc),
# точки соединены отрезками AB, BC и AC. Найдите отрезок с минимальной длинной.
# Если отрезков с минимальной длиной несколько - вывести любой

# При решении задачи необходимо использовать функцию расстояния между двумя точками.

def distance(x1, y1, x2, y2) -> float:
    """
    :param x1: координата х первой точки
    :param y1: координата у1
    :param x2: координата х2
    :param y2: координата у2
    :return: расстояние между точками
    """
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5


def min_line(p1, p2, p3) -> str:
    a = distance(*p1, *p2)
    b = distance(*p2, *p3)
    c = distance(*p1, *p3)
    if a < b and a < c:
        return "AB"
    elif b < c:
        return "BC"
    else:
        return "AC"


print("Самый короткий отрезок:", min_line((-1, -1), (1, 1), (3, 4)))  # Выводим название отрезка, например “АС”.
