# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc),
# точки соединены отрезками AB, BC и AC. Найдите отрезок с минимальной длинной.
# Если отрезков с минимальной длиной несколько - вывести любой

# При решении задачи необходимо использовать функцию расстояния между двумя точками.

def distance(x1, y1, x2, y2):
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5


a, b, c = (1, 1), (2, 3), (4, 6)
ab, bc, ac = distance(*a, *b), distance(*b, *c), distance(*a, *c)
min_name = "AB"
if bc == min(ab, bc, ac):
    min_name = "BC"
elif ac == min(ab, bc, ac):
    min_name = "AC"
print("Самый короткий отрезок:", min_name)  # Выводим название отрезка, например “АС”.

