# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def IsInside(p1, p2, r1, r2):
    return (p1[0] - p2[0]) ** 2 + (p1[1] - p2[1]) ** 2 > (r1 - r2) ** 2


if IsInside((5, 6), (3, 3), 1, 2):
    print("Круг расположен внутри")
