# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def distance(x1, y1, x2, y2) -> float:
    return ((x1 - x2) ** 2 + (y1 - y2) ** 2) ** 0.5


p1 = (1, 1)
p2 = (1, 2)
r1 = 20
r2 = 19

if distance(*p1, *p2) + r2 <= r1 or distance(*p1, *p2) + r1 <= r2:
    print("Одна окружность внутри другой")
else:
    print("Ни одна из окружностей не содержит другую")
