# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def distance(x1, y1, x2, y2):
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5


def circles(x1, y1, x2, y2, r1, r2):
    dist = distance(x1, y1, x2, y2)
    if r1 > r2:
        if dist + r2 <= r1:
            print(f"Окружность с радиусом {r2} находиться в окружности с радиусом {r1}")
    else:
        print(f"Окружность с радиусом {r1} находиться в окружности с радиусом {r2}")
    return


circles(0, 0, 0, 0, 3, 4)
