# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и их радиусы R1 и R2.
# Находится ли одна окружность целиком внутри другой

def distance(x1, y1, x2, y2) -> float:
    """
    :param x1: координата х первой точки
    :param y1: координата у1
    :param x2: координата х2
    :param y2: координата у2
    :return: расстояние между точками
    """
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5


def is_one_circle_in_two(p1, p2, r1, r2) -> bool:
    """
    :param p1: координаты (х, y) первой точки
    :param p2: координаты (х, y) второй точки
    :param r1: радиус первой окружности
    :param r2: радиус второй окружности
    :return: находится ли одна окружность внутри другой
    """
    if r1 > r2:
        r1, r2 = r2, r1
    return distance(*p1, *p2) + r1 <= r2


print(is_one_circle_in_two((0, 0), (10, 3), 1, 4))
