# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def distance(x1, y1, x2, y2):
    return ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5


crcl1, crcl2 = (3, 5), (2, 3)
rad1, rad2 = 3, 6
if distance(*crcl1, *crcl2) < abs(rad1 - rad2):
    print("Окружность лежит целиком внутри другой окружности")
else:
    print("Окружность не лежит целиком внутри другой окружности")
