# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

x1 = float(input("Введите координату x для первой окружности: "))
y1 = float(input("Введите координату y для первой окружности: "))
r1 = float(input("Введите радиус первой окружности: "))
x2 = float(input("Введите координату x для второй окружности: "))
y2 = float(input("Введите координату y для второй окружности: "))
r2 = float(input("Введите радиус второй окружности: "))

# вычисляем расстояние между центрами окружностей
distance = ((x2 - x1) * 2 + (y2 - y1) * 2) ** 0.5

if distance < (r1 - r2) ** 2:
    print("Вторая окружность находится внутри первой")
elif distance < (r2 - r1) ** 2:
    print("Первая окружность находится внутри второй")
elif distance <= (r1 + r2) ** 2:
    print("Окружности пересекаются")
else:
    print("Окружности не пересекаются")
