# Написать программу, выполняющую операции (сложение и вычитание) с простыми дробями.
# Дроби вводятся и выводятся в формате: n x/y
# ,где n - целая часть, x - числитель, у - знаменатель.
# Дроби могут быть отрицательные и не иметь целой части, или иметь только целую часть.

# Примеры:
# Ввод: 5/6 + 4/7 (всё выражение вводится целиком в виде строки)
# Вывод: 1 17/42  (результат обязательно упростить и выделить целую часть)
# Ввод: -2/3 - -2
# Вывод: 1 1/3

# TODO: your code here
def nod(n, a, b, n1, a1, b1):
    if b != 0 and b1 != 0:
        c = (b1 * (n * b + a) + b * (n1 * b1 + a1)) / (b * b1)

    return c
def nod1(n, a, b, n1, a1, b1):
    if b != 0 and b1 != 0:
        c1 = (b1 * (n * b + a) - b * (n1 * b1 + a1)) / (b * b1)

    return c1


print(nod(1, 1, 2, 0, 1, 4))
print(nod1(1, 1, 2, 0, 1, 4))

