## "Подсчет символов"

### Задание

Подсчитать количество букв «б» во введенной строке

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество найденных букв.

### Решение задачи

```python
text = input("Введите произвольный текст: ")
i = 0
Count = 0
while i < len(text):
    if text[i] == "б" or text[i] == "Б":
        Count += 1
    i += 1
print("Количество букв Б в слове", Count)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Для решения задачи найдите подходящий метод строки.
</details>
