## "Подсчет символов"

### Задание

Подсчитать количество букв «б» во введенной строке

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество найденных букв.

### Решение задачи

```python
text = input("Введите текст: ")
count = 0
count_words = 0

while count <= len(text) - 1:
    if text[count] == "б":
        count_words += 1
    count += 1
print("Количество букв 'б' в тексте равно:", count_words)
---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Для решения задачи найдите подходящий метод строки.
</details>
