## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
text1 = "qqqwwwt"
text2 = "qwqtwqw"
index = 0
flag = True
while index < len(text1):
    if text2.count(text1[index]) != text1.count(text1[index]):
        flag = False
    index += 1
if flag:
    print('Можно')
else:
    print('Нельзя')
```

---

