## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
str1 = input("str1: ")
str2 = input("str2: ")
its_possible = True
i = 0
if (len(str1) == len(str2)):
    while i < len(str1):
        if (str2.find(str1[i]) != -1):
            str2.replace(str1[i], "")
        else:
            its_possible = False
            break
        i += 1
else:
    its_possible = False
print(its_possible)

```

---

