## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
s1 = input("Введите строку s1: ")
s2 = input("Введите строку s2: ")
result = ""

i = 0
j = 0

while i < len(s2) and result == "":
    if s1.find(s2[i]) == -1:
        result = "Нет"
    while j < len(s1):
        if s2.count(s2[i]) > s1.count(s2[i]):
            result = "Нет"
        j += 1
    i += 1
if result == "":
    print("Да")
else:
    print(result)
```

---

