## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
# TODO: you code here...
string1 = str(input()).lower()
string2 = str(input()).lower()

i = 0
is_true = True
while i < len(string1):
    if string2.find(string1[i]) == -1:
        is_true = False
        break
    i += 1
if is_true:
    print("Да")
else:
    print("Нет")

```

---

