## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```

s1 = input("S1: ")
s2 = input("S2: ")

s1_len = len(s1)
i = 0
flag = 1

while i < s1_len:
    if s2.count(s1[i]) > s1.count(s1[i]):
        i = s1_len
        flag = 0
    else:
        i += 1
if flag == 1:
    print("Да")
else:
    print("Нет")
    
```

---

