## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
string = input('Первая строка (словарь): ')
string2 = input('Вторая строка: ')
string = ' ' + string
i = 0
can_flag = False
while i < len(string2):
    if string.find(string2[i]) != -1:
        string = string.replace(string2[i], '', 1)
        can_flag = True
    else:
        can_flag = False
        break
    i += 1
if can_flag:
    print('Можно')
else:
    print('Нельзя')
```

---

