## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
string1 = input("string1: ")
string2 = input("string2: ")

for letter in string1:
    string2 = string2.replace(letter, '', 1)

if len(string2) == 0:
    print("Да")
else:
    print("Нет")
```

---

