## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
string1 = input("string1:")
string2 = input("string2:")

# string1 = "паспорт"
# string2 = "спорт"

i = 0
cnt = 0

while i < len(string2):
    count1 = string1.lower().count(string2[i])
    count2 = string2.lower().count(string2[i])
    if count2 <= count1:
        cnt += 1
    i += 1

if cnt == len(string2):
    print("Да")
else:
    print("Нет")

```

---

