## "Подсчет длинных слов"

### Задание

Определить в предоставленном сообщении количество слов длиной больше, чем 5.

### Формат входных данных

Дана строка текста, слова разделены пробелами, знаки препинания отсутствуют.

### Формат выходных данных

Вывести количество найденных слов.

### Решение задачи

```python
a = input("Введите текст: ").split()
count_words = 0
i = 0
while i < len(a):
    if len(a[i]) > 5:
        count_words += 1
    i += 1
print((count_words))
```

---

