## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
text1 = "qqqwwwt" 
#text1 = input("Текст 1: ")
text2 = "qwqtwqw" 
#text1 = input("Текст 2: ")
index = 0
flag = True
while index < len(text1):
    if text2.find(text1[index]) >= 0:
        text2 = text2.replace(text1[index], '', 1)
    else:
        flag = False
    index += 1
if flag and len(text2) == 0:
    print('Можно')
else:
    print('Нельзя')

```

---

