## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

s1 = input("s1: ")
s2 = input("s2: ")

buff1 = s1
buff2 = s2
i = 0
while i < len(s2):
    if buff1.count(s2[i:i+1]) == buff2.count(s2[i:i+1]):
        buff1 = buff1.replace(s2[i:i+1], "")
        buff2 = buff2.replace(s2[i:i+1], "")
    i += 1

print("Да" if buff2 == "" else "Нет")
