## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
s1="iuwerygkf,dfshn,vsd"
s2="iuwerygkf,dfshn,vsv"
i=0
while i<len(s2):
    if s2.count(s2[i])>s1.count(s2[i]):
        k="Нет"
        i=len(s2)+1
    else:
        k="Да"
        i+=1
print(k)
```

---

