# Напишите функцию,  определяющую является ли число палиндромом.
# Палиндром - число читающееся одинаково слева направо и справа налево.
# Пример палиндрома: 34543
# * попробуйте решить данную задачу не используя строки


def palindrome(number):
    return str(number) == str(number)[::-1]

input_number = int(input("Введите число: "))
if palindrome(input_number):
    print("Число является палиндромом")
else:
    print("Число не является палиндромом")
