# Напишите функцию,  определяющую является ли число палиндромом.
# Палиндром - число читающееся одинаково слева направо и справа налево.
# Пример палиндрома: 34543
# * попробуйте решить данную задачу не используя строки

def palindrome(number):

    digits = []

    while number != 0:
        digits.append(number % 10)
        number = number // 10
    print(digits)

    while digits:
        if digits[0] == digits[-1]:
            digits.pop(0)
            if len(digits) != 0:
                digits.pop(-1)
        else:
            return False
    return True


# Тестируем функцию
print(palindrome(3454))
print(palindrome(3443))
print(palindrome(1234541))
print(palindrome(1234321))
print(palindrome(77777))

# Подсказка:
# Самый простой способ решить задачу, работать с полученным числом как со строкой
# Преобразование к строке:  str(1234) --> "1234"
# Переворот строки:         "1234"[::-1] --> "4321"
