# Даны координаты двух точек на плоскости.
# Напишите функцию нахождения расстояния между двумя точками.

def distance(x1: int, y1: int, x2: int, y2: int) -> int:
    """
    Поиск расстояния между точками
    :param x1: координата х1
    :param y1: координата у1
    :param x2: координата х2
    :param y2: координата у2
    :return: расстояние между точками
    """
    return (((y1-x1)**2) + ((y2-x2)**2))**0.5


# Тестируем функцию
print(distance(2, 4, 2, 9))
print(distance(12, 8, 12, -9))
print(distance(23, 0, 15, 32))
