# Даны координаты двух точек на плоскости.
# Напишите функцию нахождения расстояния между двумя точками.

def distance(x1, y1, x2, y2):
    l = ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    return l


print(distance(0, 0, 2, 0))
print(distance(12, 8, 12, -9))
print(distance(23, 0, 15, 32))
