# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

 # Находим длины отрезков между точками
    a = ((p2[0] - p1[0])**2 + (p2[1] - p1[1])**2)**0.5
    b = ((p3[0] - p2[0])**2 + (p3[1] - p2[1])**2)**0.5
    c = ((p1[0] - p3[0])**2 + (p1[1] - p3[1])**2)**0.5
    
 # Проверяем, что длины отрезков соответствуют неравенству треугольника
    return a + b > c and a + c > b and b + c > a
    pass


# Пример вызова функции
can_triangle((10, 12), (14, 18), (12, 12))

# Не забудьте протестировать вашу функцию
