# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

!!!Не могу поянть поему не работает. print выводит false, а при работе программы ничего не выводится!!!
def can_triangle(p1, p2, p3):
    ab = ((p2[0] - p1[0]) ** 2 + (p2[1] - p1[1]) ** 2) ** 0.5
    ac = ((p3[0] - p1[0]) ** 2 + (p3[1] - p1[1]) ** 2) ** 0.5
    bc = ((p3[0] - p2[0]) ** 2 + (p3[1] - p2[1]) ** 2) ** 0.5
    return (ab > (ac + bc) and ac > (ab + bc) and bc > (ab + ac))


can_triangle((10, 12), (14, 18), (12, 12))
