# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(x1, y1, x2, y2, x3, y3):
    l1 = ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    l2 = ((x2 - x3) ** 2 + (y2 - y3) ** 2) ** 0.5
    l3 = ((x3 - x1) ** 2 + (y3 - y1) ** 2) ** 0.5
    return (l1 + l2) > l3 and (l2 + l3) > l1 and (l1 + l3) > l2


print(can_triangle(0, 1, 0, 2, 0, 3))

# Не забудьте протестировать вашу функцию
