# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    if p1 == p2 or p1 == p2 or p2 == p3:
        print('нельзя построить')
    else:
        tan1 = abs((p2[1] - p1[1]) / (p2[0] - p1[0]))
        tan2 = abs((p3[1] - p1[1]) / (p3[0] - p1[0]))
        if tan1 == tan2:
            print('нельзя построить')
        else:
            print('можно построить')
        return


# Пример вызова функции
can_triangle((10, 12), (14, 18), (12, 12))
can_triangle((1, 1), (2, 2), (3, 3))
can_triangle((-1, -1), (2, 2), (3, 3))
can_triangle((1, 9), (1, 1), (1, 1))
# Не забудьте протестировать вашу функцию

