# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    a1 = p1[0]
    a2 = p1[1]
    b1 = p2[0]
    b2 = p2[1]
    c1 = p3[0]
    c2 = p3[1]
    ab = (((b1-a1)**2) + ((b2-a2)**2))**0.5
    ac = (((c1 - a1) ** 2) + ((c2 - a2) ** 2)) ** 0.5
    bc = (((b1 - c1) ** 2) + ((b2 - c2) ** 2)) ** 0.5
    if ab+bc>ac and bc+ac>ab and ab+ac>bc:
        return "Треугольник можно построить"
    return "Треугольник нельзя построить"

# Пример вызова функции
result = can_triangle((10, 12), (14, 18), (12, 12))
print(result)

