# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    if not (p1[0] * p2[1] == p1[1] * p2[0] and p1[0] * p3[1] == p1[1] * p3[0]):
        print("Можно построить")
    else:
        print("Нельзя построить")


can_triangle((10, 12), (14, 18), (12, 12))
can_triangle((0, 0), (3, 3), (6, 6))

# Не забудьте протестировать вашу функцию
