# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    # TODO: your code here
    pass


# Пример вызова функции
can_triangle((10, 12), (14, 18), (12, 12))

# Не забудьте протестировать вашу функцию


def can_triangle(p1, p2, p3):

    a = ((p2[0] - p1[0]) ** 2 + (p2[1] - p1[1]) ** 2) ** 0.5  # p1p2
    b = ((p3[0] - p3[0]) ** 2 + (p3[1] - p3[1]) ** 2) ** 0.5  # p2p3
    c = ((p3[0] - p1[0]) ** 2 + (p3[1] - p1[1]) ** 2) ** 0.5  # p1p3
    return a + b > c and a + c > b and b + c > a

# Пример вызова функции
result = can_triangle((10, 12), (14, 18), (12, 12))
print(result)
