# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    ord1 = p3[1] - p1[1]
    ord2 = p2[1] - p1[1]
    absc1 = p2[0] - p1[0]
    absc2 = p3[0] - p1[0]
    if (absc2) / (absc1) == (ord1) / (ord2):
        print("Нельзя")
    else: 
        print("Можно")

# Пример вызова функции
can_triangle((13, 13), (14, 14), (12, 12))

# Не забудьте протестировать вашу функцию
