# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def triang(p1, p2, p3):
    l1 = ((p1[0] - p2[0]) ** 2 + (p1[1] - p2[1]) ** 2) ** 0.5
    l2 = ((p2[0] - p3[0]) ** 2 + (p2[1] - p3[1]) ** 2) ** 0.5
    l3 = ((p1[0] - p3[0]) ** 2 + (p1[1] - p3[1]) ** 2) ** 0.5
    perim = (l1 + l2 + l3) / 2
    area = (perim * (perim - l1) * (perim - l2) * (perim - l3))
    if area == 0:
        print("По заданным точкам треугольник построить нельзя")
    else:
        print("По заданным точкам треугольник построить можно")
    return perim, area

print(triang((10, 12), (14, 18), (12, 12)))
print(triang((10, 10), (14, 14), (12, 12)))


# Не забудьте протестировать вашу функцию
