# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def triangle_test(p1, p2, p3):
    if p1[0] * p2[1] == p1[1] * p2[0] and p1[0] * p3[1] == p1[1] * p3[0]:
        print("Нельзя построить")
        return
    len_1 = ((p1[0] - p2[0]) ** 2 + (p1[1] - p2[1]) ** 2) ** 0.5
    len_2 = ((p1[0] - p3[0]) ** 2 + (p1[1] - p3[1]) ** 2) ** 0.5
    len_3 = ((p3[0] - p2[0]) ** 2 + (p3[1] - p2[1]) ** 2) ** 0.5
    p = (len_1 + len_2 + len_3)
    half_p = (len_1 + len_2 + len_3) / 2
    s = (half_p * (half_p - len_1) * (half_p - len_2) * (half_p - len_3)) ** 0.5
    print("Площадь:", s)
    print("Периметр:", p)
    print("-----------------------")


triangle_test((10, 12), (14, 18), (12, 12))
triangle_test((0, 0), (3, 3), (6, 6))


# Не забудьте протестировать вашу функцию
