# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def can_triangle(p1, p2, p3):
    a1 = p1[0]
    a2 = p1[1]
    b1 = p2[0]
    b2 = p2[1]
    c1 = p3[0]
    c2 = p3[1]
    ab = (((b1-a1)**2) + ((b2-a2)**2))**0.5
    ac = (((c1 - a1) ** 2) + ((c2 - a2) ** 2)) ** 0.5
    bc = (((b1 - c1) ** 2) + ((b2 - c2) ** 2)) ** 0.5
    if ab+bc>ac and bc+ac>ab and ab+ac>bc:
        return ab+ac+bc, (ab+ac+bc/2*(ab+ac+bc/2 - ac)*(ab+ac+bc/2 - ab)*(ab+ac+bc/2 - bc))**0.5
    return "Треугольник не существует"

result = can_triangle((10, 12), (14, 18), (12, 12))
print(result)


