# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def can_triangle(p1, p2, p3):
    l12 = ((p1[0] - p2[0]) ** 2 + (p1[1] - p2[1]) ** 2) ** 0.5
    l23 = ((p2[0] - p3[0]) ** 2 + (p2[1] - p3[1]) ** 2) ** 0.5
    l31 = ((p1[0] - p2[0]) ** 2 + (p1[1] - p2[1]) ** 2) ** 0.5
    if l12 + l23 > l31:
        p = l31 + l23 + l12
        s = (p / 2 * (p / 2 - l12) * (p / 2 - l23) * (p / 2 - l31)) ** 0.5
    return (p, s)


print(can_triangle((0, 0), (0, 2), (2 , 0)))


# Не забудьте протестировать вашу функцию
