# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.

def triangle(xa, ya, xb, yb, xc, yc):
    ab = ((xb - xa) ** 2 + (yb - ya) ** 2) ** 0.5
    bc = ((xc - xb) ** 2 + (yc - yb) ** 2) ** 0.5
    ac = ((xa - xc) ** 2 + (ya - yc) ** 2) ** 0.5
    if (ab + bc) > ac and (bc + ac) > ab and  (ab + ac) > bc:
        p = 0.5*(ab + bc+ ac)
        c = (p * (p-ab) * (p-bc)*(p-ac))**0.5
        return c
    else:
        print("Треугольник не существует")


# Тестируем функцию
print(triangle(1, 1, 1, 1, 100, 0))
