# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def can_triangle(p1, p2, p3):
    l1 = ((p2[0] - p1[0]) ** 2 + (p2[1] - p1[1]) ** 2) ** 0.5
    l2 = ((p3[0] - p1[0]) ** 2 + (p3[1] - p1[1]) ** 2) ** 0.5
    l3 = ((p2[0] - p3[0]) ** 2 + (p2[1] - p3[1]) ** 2) ** 0.5
    if l1 + l2 > l3 and l1 + l3 > l2 and l2 + l3 > l1:
        p = l1 + l2 + l3
        s = (p * (p - l1) * (p - l2) * (p - l3)) ** 0.5
        print(p)
        print(s)
    else:
        print("Не существует")


can_triangle((10, 12), (14, 18), (12, 12))


# Не забудьте протестировать вашу функцию
