# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def print_triangle(p1, p2, p3):
    a = ((p2[0] - p1[0]) ** 2 + (p2[1] - p1[1]) ** 2) ** 0.5
    b = ((p3[0] - p2[0]) ** 2 + (p3[1] - p2[1]) ** 2) ** 0.5
    c = ((p3[0] - p1[0]) ** 2 + (p3[1] - p1[1]) ** 2) ** 0.5
    print_str = ""
    if (a + b) > c and (b + c) > a and (a + c) > b:
        p = (a + b + c)/2
        s = (p/2 * (p/2 - a) * (p/2 - b) * (p/2 - c)) ** 0.5
        print_str = f"P = {p}, S = {s}"
    else:
        print_str = "Невозможно построить треугольник по заданным точкам"
    return print_str


# Не забудьте протестировать вашу функцию
result = print_triangle((10, 12), (14, 18), (12, 12))
print(result)
