# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

# TODO: your code here
def triangle(a, b, c):
    if a[0] * b[1] == a[1] * b[0] and a[0] * c[1] == a[1] * c[0]:
        print("Нельзя")
        return
    len_1 = ((a[0] - b[0]) ** 2 + (a[1] - b[1]) ** 2) ** 0.5
    len_2 = ((a[0] - c[0]) ** 2 + (a[1] - c[1]) ** 2) ** 0.5
    len_3 = ((c[0] - b[0]) ** 2 + (c[1] - b[1]) ** 2) ** 0.5
    p = (len_1 + len_2 + len_3)
    half_p = (len_1 + len_2 + len_3) / 2
    s = (half_p * (half_p - len_1) * (half_p - len_2) * (half_p - len_3)) ** 0.5
    print("Площадь:", s, "Периметр:", p) # не найду округление забыл ((


triangle((2, 4), (6, 12), (1, 9))
triangle((1, 1), (99, 99), (123, 123))

# Не забудьте протестировать вашу функцию
