# Напишите функцию, которая проверит, что точка (x, y)
# находится строго внутри окружности с центром в точке (xc, yc) и радиусом r:

def point_in_circle(x, y, xc, yc, r):
    if ((x - xc) ** 2 + (y - yc) ** 2) <= r ** 2:
        print("Точка внутри круга")
    else:
        print("Точка вне круга")
    pass

# Не забудьте протестировать вашу функцию
point_in_circle(2.9, 2.9, 5, 5, 3)
