# Напишите функцию принимающую время в секундах и возвращающую строку формата: “hh:mm:ss”,
# где hh - часы, mm- минуты, ss - секунды.
def get_time(secs):
    secs = secs % 86400
    print("секунды {0} → {1:0>2}:{2:0>2}:{3:0>2}".format(secs, secs % 86400 // 3600, secs % 3600 // 60, secs % 60))


get_time(80000)
