# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = "Как много бабушек хороших"

for x in text.split():
    if x.startswith("б"):
        print(x)
else:
    print("Слов на б нет")
