## "Шахматы: слон"

### Задание

Требуется определить, бьет ли слон, стоящий на клетке с указанными координатами (номер строки и номер столбца), фигуру, стоящую на другой указанной клетке.

### Формат входных данных

Даны четыре числа целые числа в диапазоне [1, 8], координаты слона и координаты другой фигуры

### Формат выходных данных

Вывести "Да", если слон бьет фигуру или "Нет", если не бьет.

### Решение задачи

```python
check = False

while check != True:
    x = int(input("Введите x слона "))
    y = int(input("Введите y слона "))
    x_enemy = int(input("Введите x врага "))
    y_enemy = int(input("Введите y врага "))
    if (x < 1 or x > 8) and (y < 1 or y > 8) and (x_enemy < 1 or x_enemy > 8) and (y_enemy < 1 or y_enemy > 8):
        print("Координата за шахматной доской")
    else:
        check = True
dif_x = x - x_enemy
dif_y = y - y_enemy
if abs(dif_x) == abs(dif_y):
    print("Слон бьет врага!")
else:
    print("Враг неуязвим!")
```

---
