# Напишите функцию, находящую среднее арифметическое всех аргументов
# Функция должна вызываться с любым количеством аргументов

def average(*args) -> float:
    count_args = 0
    summa = 0
    for arg in args:
        summa += arg
        count_args += 1

    return (summa / count_args)


print(average(3, 4, 8))
print(average(1, 4, 5, -3, 8, 4))
print(average(-10, 12, 6.3, -5.5, 7, 0.2))
