# Напишите функцию, находящую среднее арифметическое всех аргументов
# Функция должна вызываться с любым количеством аргументов
# Напишите функцию, находящую среднее арифметическое всех аргументов
# Функция должна вызываться с любым количеством аргументов

def average(*args):
    arr = [*args]
    f = sum(arr)/len(arr)
    return f

print("Среднее значение последовательности: ", average(1,2,3,5, 10, 11, 100))
