# Даны два списка одинаковой длины. Необходимо создать из них словарь таким образом,
# чтобы элементы первого списка были ключами, а элементы второго — соответственно значениями нашего словаря.

keys = ['name', 'surname', 'age', 'rate']
values = ['Петр', 'Первый', 42, 1300]

# TODO: your code here
i = 0
my_dic = {}
while i < len(keys):
    my_dic[keys[i]] = values[i]
    i += 1
print(my_dic)
