# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
string1 = input("Введите строку: ")

i = 0
while i < len(string1):
    var = string1[i]
    if var == 'б':
        i += 1
print("В строке есть слова с буквой 'б'")

    else:
        print("В строке нет слова с буквой 'б'")
