## "Я учу питон"

### Задание

Выведите фразу "Я учу питон" n раз

### Формат входных данных

Дано целое положительное число n.

### Формат выходных данных

Вывести текст "Я учу питон" заданное количество раз.

### Решение задачи
n = int(input("кол-во итераций цикла"))
count = 0
while count < n:
    print("я учу Питон!")
    count += 1


```python
n = int(input("n: "))

# TODO: you code here...
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотрите в примерах "Выполнение цикла n раз"
</details>
