# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.


while True:
    try:
        n, m = map(int, input("Введите параметры NxM в указанном формате: ").split('x'))
        print(f'От прямоугольника {n}x{m} получится отрезать {n // m} кв. со стороной m={m}.')

    except ValueError:
        print("Не верный формат ввода параметров.")
        print()
