# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.
while True:
    try:
        n, m = input("Введите размеры прямоугольника в формате nxm: ").split('x')
        n = float(n)
        m = float(m)
        break
    except ValueError:
        print("Неправильный формат данных. Повторите ввод")

res = int(n // m)

print(f'{res} квадратов')
