# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.
while True:
    try:
        size = input("Введите размеры прямоугольника в формате nxm: ")
        n, m = map(int, size.split('x'))
        break
    except ValueError:
        print("Неверный формат ввода, попробуйте снова")

count = (n // m) ** 2

print(f"Из прямоугольника размером {n}x{m} можно вырезать квадратов со стороной m: {count}")
