# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.

while True:
    try:
        sides = input("Введите значения: ")
        n = int(sides.split("x")[0])
        m = int(sides.split("x")[1])
        break
    except ValueError:
        print("Некорректные параметры")

squares = (n // m)

print(f"В прямоугольнике размером {n}x{m} поместятся {squares} квадратов со стороной {m}")
