# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.

while True:
    try:
        line = input("nxm: ")
        n = int(line[:line.find("x")])
        m = int(line[line.find("x") + 1:])
        if line.find("x") != -1:
            break
    except ValueError:
        print("Некорректные данные. Формат ввода ЧислоxЧисло")

if n < m:
    print(0, "квадратов")
else:
    print(n // m, "квадратов")
