# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.
while True:
    string = input("Размер: ")
    if string.find("x") != -1:
        m, n = string.split("x", maxsplit=1)
        try:
            m = int(m)
            n = int(n)
            if m < 0 or n < 0:
                print("Введено отрицательное число")
            else:
                break
        except ValueError:
            print("Некорректный ввод числа")
    else:
        print("Отсутствует разделитель x")

print(m // n)
