# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.


while True:
    try:
        figure = input("Введите стороны прямоугольника в формате nxm: ")
        [n, m] = figure.split("x")
        print('n успешно преобразована к типу Int')
        print('от прямоугольника возможно отрезать', int(n) // int(m), 'квадрат со стороной m')
        break
    except ValueError:  # Тип перехватываемого исключения
        print('значение n невозможно преобразовать к типу int')
