# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.
while True:
    try:
        my_str = input("Введите размер прямоугольника: ")
        n = int(my_str[:my_str.find('x')])
        m = int(my_str[my_str.find('x') + 1:])
        break
    except:
        print("Ошибка ввода данных. Необходимо вводить числа.")
result = n // m
print(f"Можно отрезать квадратов {result} квадратов")
