# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.

while True:
    try:
        rect_str = input("Введите стороны прямоугольника в формате nxm: ").split("x")
        if len(rect_str) != 2:
            raise ValueError
        rect = [int(rect_str[0]), int(rect_str[1])]
        break
    except ValueError:
        print("Ошибка в формате данных")

print(f" Из прямоугольника получится {rect[0] // rect[1]} квадратов")
