# Дан прямоугольник размером n×m. Напишите программу, вычисляющую, сколько квадратов
# со стороной m от него получится отрезать.

# На вход программе подается строка формата nxm (x - латинская буква икс).
# Пример входных данных: 12x6
# Если данные вводятся в неверном формате, сообщить об этом и запросить ввод заново.

while True:
    try:
        square = input('Введи размер прямоугольника в формате 10x5:')
        size = square.split(sep='x')
        n = int(size[0])
        m = int(size[1])
        break
    except (ValueError, IndexError):
        print('Введены не верные данные: ')
print(f'{n=}, {m=}')
