# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
import re

words = "воображение является единственным оружием в войне против реальности"

swords = re.findall(r"\b[бБ]\w+", words)
print(swords)
if swords == []:
    print('Слов на "б" нет')
