# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = input("Введите произвольный текст: ")
text += " "
i = 0
word_len = 0
while i < len(text):
    if text[i] != " ":
        word_len += 1
    else:
        if text[i-word_len:i][0].lower() == "б":
            print(text[i - word_len:i])
            break
        word_len = 0
    i += 1
