# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "Незнакомец был здоровенным малым с загорелым и обветренным лицом"
if text[0] == "б":
    print(text[:text.find(" ")])
elif text.find(" б") != -1:
    temp_text = text[text.find(" б") + 1:]
    print(temp_text[:temp_text.find(" ")])
else:
    print("слов на б нет")
