# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = "олдыоад авоава воарыргуб букуошкщуо аварру"
i = 0
# print(text.lower().find(" б"))

if text.lower()[0] == "б":
    while i < text.find(" "):
        print(text[i], end="")
        i += 1
elif text.lower().find(" б") != -1:
    i = text.lower().find(" б") + 1
    while text[i] != " ":
        print(text[i], end="")
        i += 1
else:
    print("слов на 'б' нет")
