# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = ".fsdf."
cond_1 = text.count(',')
cond_2 = text.count('.')
if cond_1 == cond_2:
    print("одинаково")
elif cond_1 > cond_2:
    print("больше ,")
else:
    print("больше .")
