# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "На столе стоит монитор, клавиатура. Мышки нет."
comma = text.count(',')
spot = text.count('.')
if comma == spot:
    print("Одинаково")
elif comma > spot:
    print("Больше запятых")
else:
    print("Больше точек")
