# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "Дана строка состоящая из слов все слова разделены ровно одним пробелом Знаки препинания отсутствуют"
text2 = text.split(" ")
count = 0
for i in text2:
    if i[0].lower() == "б":
        print(i)
        count += 1
        break
if count == 0:
    print("слов на б нет")
