# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "Разновидностей пауков больше пятисот"
b = text.find(" б")+1
# есть баги
word = ""
if b != -1:
    while text[b] != " ":
        word += text[b]
        b += 1
    print(word)
else:
    print("слов на б нет")
