# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = 'Безусловно, высококачественный прототип будущего проекта позволяет выполнить важные задания по разработке ' \
       'распределения внутренних резервов и ресурсов. А также диаграммы связей, которые представляют собой яркий ' \
       'пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе' \
       ' маркетинговых и финансовых предпосылок. Ясность нашей позиции очевидна: дальнейшее развитие различных ' \
       'форм деятельности прекрасно подходит для реализации поэтапного и последовательного развития общества.'
points = text.count('.')
commas = text.count(',')

if points > commas:
    print('точек больше')
elif points < commas:
    print('запятых больше')
else:
    print('одинаково')
