# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Илья Горюнов, едва окончивший школу, стоял на пороге новой жизни, полной перспектив. Но все перечеркнуло неудачное стечение обстоятельств......."
commas = text.count(',')
dots = text.count('.')
if commas == dots or dots == commas:
    print("Одинаково")
elif commas > dots:
    print("Запятых больше точек: ", commas)
else:
    print("Точек больше запятых: ", dots)
