# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = "аоао паоавпоа впрвпор буврну быкнкн букнуцк ыкануцн"

num_b = text.find(" б")
if num_b != -1:
    end_of_word = text.find(" ", num_b + 1)
    print(text[num_b + 1: end_of_word])
else:
    print("слов на б нет")
