# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
import random

n = int(input("Количество чисел "))
arr = []
for ind in range(1, n + 1):
    arr.append(random.randint(-100, 100))
print(arr)
