# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("Введите текст: ")

n_point = text.count(".")
n_comma = text.count(",")

if n_point>n_comma:
    print("Точек больше")
elif n_comma>n_point:
    print("Запятых больше")
else:
    print("Точек и запятых одинаково")
