# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = 'езусловно высококачественный прототип будущего проекта позволяет выполнить важные задания по разработке ' \
       'распределения внутренних резервов и ресурсов А также диаграммы связей которые представляют собой яркий ' \
       'пример континентально-европейского типа политической культуры будут рассмотрены исключительно в разрезе' \
       ' маркетинговых и финансовых предпосылок'

flag_b_word = False

for word in text.lower().split(' '):
    if word[0] == 'б':
        print(word)
        flag_b_word = True
        break
if not flag_b_word:
    print('Слов на б нет')
