# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "Дана строка состоящая из Бслов все слова разделены ровно одним пробелом"
lower_text = text.lower().split()
for b_word in lower_text:
    if 'б' in b_word[0]:
        print("Первое слово на букву 'б': ", b_word)
        break
else:
    print("слов на 'б' нет")
