# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = "Бобер быстро сроил плотину"
text = text.lower()
words = text.split()
word_b = ""

for word in words:
    if word[0] == "б":
        word_b = word

print("Слово на б:", word_b)
