# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "...ывпывпы,,,"

print("одинаково" if text.count(".") == text.count(",") else "")
