# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = "Аааа Ввввв Бббббб"

i = 0
summa_yes = 0
summa_no = 0

while i < len(text):
    if text[i] == "б":
        summa_yes = summa_yes + 1
    else:
        summa_no = summa_no + 1
    i = i + 1
if summa_yes > 0:
    print("слово, начинающееся на букву Б найдено")
else:
    print("слов на б нет")
