# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "тестовое базовое предложение будет тут"
text_arr = text.split(" ")
print(text_arr)
catched = "слов на б нет"
for txt in text_arr:
    if txt[0] == "б":
        catched = txt
        break
print(catched)
