# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
str = input("Текст: ")
for w in str.split(): 
    if w.startswith("б"): 
        print(w) 
    else:
        print("на букву б ничего нет ")
