# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"


text = "Являясь всего лишь частью общей картины, интерактивные прототипы будут превращены в посмешище, хотя само их " \
       "существование приносит несомненную пользу обществу. А ещё некоторые особенности внутренней политики " \
       "своевременно верифицированы. Безусловно, социально-экономическое развитие напрямую зависит от как " \
       "самодостаточных, так и внешне зависимых концептуальных решений. "

count_point = text.count(".")
count_comma = text.count(",")

if count_point > count_comma:
    print("Точек больше")
elif count_point < count_comma:
    print("Запятых больше")
else:
    print("Одинаково")
