# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("Введите текс: ")

if text.count(".") > text.count(","):
    print("Больше точек")
elif text.count(".") < text.count(","):
    print("Больше запятых")
else:
    print("Одинаково")

