# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "ана строка состоящая из слов все слова базделены ровно одним пробелом баран Знаки препинания отсутствуют"

find_word = False
words = text.lower().split(" ")
for word in words:
    if word[0] == "б":
        find_word = True
        print(word)
        break

if not find_word:
    print("слов на б нет")
