# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = 'Вы можете соглашаться или не соглашаться с тем, что прочитаете в этой книге.'
comma = text.count(',')
point = text.count('.')
if comma > point:
    print('Больше запятых')
elif point > comma:
    print('Больше точек')
else:
    print('Одинаково')
