# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Дан произвольный текст... Каких,,, символов больше, точек . или запятых , "
print(text.count("."))
print(text.count(","))
print("Каких символов больше?")
if text.count(".")>text.count(","):
    print("Точек больше")
elif text.count(".")==text.count(","):
        print("точек и запятых одинаково")
else:
        print("Запятых больше")
