# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("Введите произвольный текст: ")
if text.count(".") == text.count(","):
    print("Количество одинаково")
else:
    print("Количество неодинаково")
