# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

# Каких символов больше, точек "." или запятых ","?

text = "Да нет, этого мало, Кулигин! Он прежде наломается над нами, наругается всячески, как его душе угодно, а кончит все-таки тем, что не даст ничего или так, какую-нибудь малость. Да еще станет рассказывать, что из милости дал, что и этого бы не следовало."

count_dot = 0
count_comma = 0
i = 0

while i < len(text):
    if text[i] == ".":
        count_dot += 1
    elif text[i] == ",":
        count_comma += 1
    i += 1

# Блок для проверки значений
print("Количество точек: ", count_dot)
print("Количество запятых: ", count_comma)
# ------

if count_dot == count_comma:
    print("Одинаково")

