# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "хоронили тёщу поовали два бояна конктерно бухали"
print("Позиция первого слова: ", text.find("б"))
begin = text.find("б")
end = text.find(" ", begin)
print(text[begin:end]) # выводит само слово
