# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Всегда пишите код так, будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете."
string_cp = text.replace(',', "")
print(string_cp)
