# Посчитайте количество согласных букв в данной строке.

import re

text = "Мониторинг проекта — это комплексная задача. " \
       "В неё входит не только передача метрик, но и сбор логов, " \
       "трейсов, health-чеки, правила для алертов и система " \
       "их доставки до ответственных разработчиков." \
       "Важно, чтобы мониторинг развивался планомерно в процессе разработки бизнес-логики. " \
       "В этой статье я расскажу о том, как подойти к реализации мониторинга " \
       "со стороны разработки так, чтобы он был полезен и удобен в использовании."

regex = re.compile('[^a-zа-я]')

text = regex.sub('', text.lower())

vowels = "ауоыэяюёие"

count_consonants = 0
count_vowels = 0
for letter in text:
    if letter in vowels:
        count_vowels += 1
    else:
        count_consonants += 1

print("В тексте", count_consonants, "согласных букв, остальные", count_vowels, "гласные")
