# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Наше дело не так однозначно, как может показаться: укрепление и развитие внутренней структуры выявляет " \
       "срочную потребность дальнейших направлений развития. Приятно, граждане, наблюдать, как сделанные на базе " \
       "интернет-аналитики выводы ассоциативно распределены по отраслям."
count_points = 0
count_comma = 0

words = text.split(" ")
for word in words:
    if word.endswith(","):
        count_comma += 1
    elif word.endswith("."):
        count_points += 1
if count_points > count_comma:
    print("Точек больше")
elif count_points < count_comma:
    print("Запятых больше")
else:
    print("Одинаково запятых и точек")
