# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = 'Дан произвольный текст. Каких символов больше, точек "." или запятых ","?'

if text.count(".") == text.count(","):
    print("Одинаково.")
elif text.count(".") > text.count(","):
    print("Точек больше.")
else:
    print("Запятых больше.")
