# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "В теории, теория, и практика неразделимы. На практике это не так."
start = text.lower().find(" п")
end = text.lower().find(" ",start+1)
print(text[start+1:end])
