# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = input('Введите текст: ')
lower_text = text.lower()
result = lower_text.split()
for index in result:
    if 'б' in index[0]:
        print('Первое слово в тексте на букву "б": ', index)
        break


