# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "яблоко Банан киви"
low_str = text.lower().split()
for index in low_str:
    if index [0] == 'б':
        res = index
        break
    else:
        res =  ''
if res =='':
    print("слова на б нет")
else:
     print(res)
