# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = ".,,"
i = text.count(",")
j = text.count(".")
if i > j:
    print("больше запятых")
elif j > i:
    print("больше точек")
else:
    print("одинаково")

