# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = text.split(' ')
flag = False

for word in text:
    if word[0] == 'б':
        print(word)
        flag = True
        break

if not flag:
    print("слов на б нет")
