# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = ""
b_words = []

for word in text.split():
    if word.startswith("б"):
        b_words.append(word)
print("слов на б нет" if len(b_words) == 0 else b_words[0])
