# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("Введите требуемый текс:")
point = text.count(".") # Число точек
comma = text.count(",") # Число запятых
if point < comma:
    print("Запятых больше")
elif point == comma:
    print("Точек и запятых Одинаково")
else:
    print("Точек больше")
