# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"


text = "букашка море шкаф книга телевизор каша бабушка собака холод каска обои"
num_letter = text.lower().find(" б") + 1

if text.lower().startswith("б"):
    print(text[0:text.lower().find(" ")])
elif num_letter == 0:
    print("слов на б нет")
else:
    print(text[num_letter:text.lower().find(" ", num_letter + 1)])
