# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Представьте: у вас есть файл с данными, которые вы хотите обработать в Pandas. " \
       "Хочется быть уверенным, что память не закончится. Как оценить использование памяти " \
       "с учетом размера файла? Все эти оценки могут как занижать, так и завышать использование памяти. " \
       "На самом деле оценивать использование памяти просто не стоит."

if text.find(".") > text.find(","):
    print("Точек больше")
elif text.find(".") < text.find(","):
    print("Запятых больше")
else:
    print("Одинаково")
    
