# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("Введите текст: ")

num_dots = text.count(".")
num_comma = text.count(",")

print("Точек в предложении", num_dots)
print("Запятых в предложении", num_comma)
