# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

text = "буря мглою небо кроет"
words = text.split(" ")
found = False
for one_word in words:
    if one_word[0] == 'б':
        found = True
        break

print(one_word if found else "слов на б нет")
