# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "...,,,"

dot_summ = text.count('.')
comma_summ = text.count(',')

if dot_summ == comma_summ:
    print("Точек и запятых равное количество")
elif dot_summ > comma_summ:
    print("Точек больше запятых ")
else:
    print("Запятых больше точек")
