# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
r = input("Введите текст:").split(" ")
n = "б"
h = "а","в","г","д","е","ж","з","и","к"
l = []
count = 0
for i in r:
    if i.startswith(h):
        print("Слов, которые начинаются на букву б нет")
for i in r:
    if i.startswith(n):
        l.append(i)
        print(f"Слова, которые начинаются на букву б: {l}")
