# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Задача организации, в особенности же постоянное..."
points = text.count(".")
commas = text.count(",")
if points == commas:
    print("одинаково")
elif points > commas:
    print("Точек больше")
elif points < commas:
    print("Запятых больше")
