# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"

fraze = "Мама мыла раму"
#fraze = "Теперь брат моет белую раму"

if fraze.find("б") != -1:
    print("Слово с буквой Б есть в предложении")
else:
    print("Отсутствует слово с буквой Б в предложении")
