# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "В этом мире неважно, сколько вы сделали. Самое главное — суметь убедить людей, что вы сделали много.Артур Конан Дойл."
step1 = text.count(',')
step2 = text.count('.')
if step2 > step1:
    print("Больше точек")
elif step2 < step1:
    print("Больше запятых")
else:
    print("Одинаково")
