# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "каких, знаков, больше. точек. или. запятых,"
if text.count(",") == text.count("."):
    print("одинаков")
