# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = 'В ночном небе видно созвездие большой медведицы.'
b = text.title().find('Б')
print(text.title())
if b >= 0:
    while text[b] != ' ':
        print(text[b], end='')
        b += 1
else:
    print('слов на б нет')
