# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "Огонь вода ветер бункер бублик смерч"  # ввод строки
words = text.split()  # разделение строки на слова

for word in words:
    if word[0] == 'б':
        print(word)
        break
else:
    print('слов на б нет')
