# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "В частности внедрение современных методик обеспечивает актуальность как самодостаточных так и внешне " \
       "зависимых концептуальных решений Вот вам яркий пример больших современных тенденций перспективное планирование " \
       "прекрасно подходит для реализации экономической целесообразности принимаемых решений"

result = ""
words = text.split(" ")
for word in words:
    if word.startswith("б"):
        result = word
        break
    else:
        result = "слов на б нет"
print(result)
