# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = input("Введите текст через пробел: ")
# пит сит кит рип гид слон наполеон кирпич
new_text = text.lower().split(" ")
len_text = len(new_text)
num_word = 1

for word in new_text:
    if word[0] == "б":
        print("Первое слово, начинающееся на букву Б: ", word)
        break
    elif num_word == len_text:
        print("Слова на букву Б нет")
    num_word += 1
