# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "В человеке должно быть все прекрасно: и лицо, и одежда, и душа, и мысли."
comma = text.count(",")
dot = text.count(".")
if comma > dot:
    print ("запятых больше")
elif comma < dot:
    print("точек больше")
else:
    print("одинаково")
