# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = ...
text = ''
print('Точек: ', (text.count('.')))
print('Запятых: ', (text.count(',')))
if (text.count('.')) == (text.count(',')):
    print('Одинаково')
