# Дана строка состоящая из слов, все слова разделены ровно одним пробелом. Знаки препинания отсутствуют.
# Найдите первое слово, начинающееся на букву "б"
# если слова на эту букву нет, выведите "слов на б нет"
text = "Таким бобразом сложившаяся бструктура организации требует от Бу нас системного анализа системы обучения кадров"
n=text.lower().find(" б")+2
if n>0:
    print(n)
else:
    print("слов на б нет")
