# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = "Когда я гулял, шел дождь. Дуль ветер, сверкала гроза, гремел гром."
count_d = 0
count_c = 0
count_d = text.count(".")
count_c = text.count(",")
if count_d > count_c:
    print("больше .")
elif count_c > count_d:
    print("больше ,")
else:
    print("одинаково")
