## "Простая обработка файла"

### Задание

Дан файл [data/numbers.txt](data/numbers.txt) с целыми числами. 

Найдите сумму всех чисел в файле и их среднеарифметическое.

### Формат входных данных

Дан текстовый файл. В каждой строке файла записано целое число.

### Формат выходных данных

Вывести сумму всех чисел и среднеарифметическое этих чисел.

### Решение задачи

path = "numbers.txt"  # вместо dir подставь название папки с файлом.

f = open(path, "r")

sum_numbers = 0  # Переменная для подсчета суммы
for num, line in enumerate(f):
    sum_numbers += int(line)
print(f"Сумма чисел = {sum_numbers}")
print(f"Среднеарифметическое = {sum_numbers / (num + 1)}")

f.close()


---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Работайте с файлом построчно:

Прочитали строку --> Преобразовали к int'у --> Добавили к общей сумме
</details>

<details>
<summary>Подсказка-2</summary>
Для подсчета количества создайте переменную счетчик и увеличивайте ее на единицу, считывая очередное значение из файла
</details>
