## "Простая обработка файла"

### Задание

Дан файл [data/numbers.txt](data/numbers.txt) с целыми числами. 

Найдите сумму всех чисел в файле и их среднеарифметическое.

### Формат входных данных

Дан текстовый файл. В каждой строке файла записано целое число.

### Формат выходных данных

Вывести сумму всех чисел и среднеарифметическое этих чисел.

### Решение задачи

```python
# Задаем путь к файлу:
import os

path = os.path.join('git_repo/Python_course/data', 'numbers.txt')

# Открываем файл на чтение
f = open(path, "r")
sum_numbers = 0     # Переменная для подсчета суммы
count_num = 0       # Переменная для подсчёта количества чисел
# В переменную line считываем строку за стройкой из файла(f)
for line in f:
    sum_numbers += int(line.rstrip())
    count_num +=1
print(f"Сумма чисел = {sum_numbers}")
print(f"Среднеарифметическое = {round(sum_numbers/count_num, 2)}")
f.close()
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Работайте с файлом построчно:

Прочитали строку --> Преобразовали к int'у --> Добавили к общей сумме
</details>

<details>
<summary>Подсказка-2</summary>
Для подсчета количества создайте переменную счетчик и увеличивайте ее на единицу, считывая очередное значение из файла
</details>
