## "Простая обработка файла"

### Задание

Дан файл [data/numbers.txt](data/numbers.txt) с целыми числами. 

Найдите сумму всех чисел в файле и их среднеарифметическое.

### Формат входных данных

Дан текстовый файл. В каждой строке файла записано целое число.

### Формат выходных данных

Вывести сумму всех чисел и среднеарифметическое этих чисел.

### Решение задачи

```python
# Задаем путь к файлу:
path = "dir/numbers.txt"  # вместо dir подставь название папки с файлом.
# Или удалите dir, если numbers.txt в той же папке, что и питоновский файл

# Открываем файл на чтение
f = open(path, "r")
sum_numbers = 0  # Переменная для подсчета суммы
# В переменную line считываем строку за стройкой из файла(f)
for line in f:
    ...
print(f"Сумма чисел = {sum_numbers}")
print(f"Среднеарифметическое = {...}")
```

# Задаем путь к файлу:
path = "um.txt"  # вместо dir подставь название папки с файлом.
# Или удалите dir, если numbers.txt в той же папке, что и питоновский файл

# Открываем файл на чтение
f = open(path, "r", encoding="utf-8")
sum_numbers = 0  # Переменная для подсчета суммы
count = 0
# В переменную line считываем строку за стройкой из файла(f)
for line in f:
    sum_numbers = int(line) + sum_numbers
    count = count + 1
average = sum_numbers/count

print(f"Сумма чисел = {sum_numbers}")
print(f"Среднеарифметическое = {average}")

### Подсказки

<details>
<summary>Подсказка-1</summary>
Работайте с файлом построчно:

Прочитали строку --> Преобразовали к int'у --> Добавили к общей сумме
</details>

<details>
<summary>Подсказка-2</summary>
Для подсчета количества создайте переменную счетчик и увеличивайте ее на единицу, считывая очередное значение из файла
</details>
