## "Простая обработка файла"

### Задание

Дан файл [data/numbers.txt](data/numbers.txt) с целыми числами. 

Найдите сумму всех чисел в файле и их среднеарифметическое.

### Формат входных данных

Дан текстовый файл. В каждой строке файла записано целое число.

### Формат выходных данных

Вывести сумму всех чисел и среднеарифметическое этих чисел.

### Решение задачи

file = open("numbers.txt", "r", encoding="UTF-8")
sum_numbers  = 0
i = 0
for line in file:
    sum_numbers  += int(line.rstrip())
    i += 1
    avg = sum_numbers  / i
print(f"Сумма чисел = {sum_numbers}")
print(f"Среднеарифметическое = {avg}")
file.close()

### Подсказки

<details>
<summary>Подсказка-1</summary>
Работайте с файлом построчно:

Прочитали строку --> Преобразовали к int'у --> Добавили к общей сумме
</details>

<details>
<summary>Подсказка-2</summary>
Для подсчета количества создайте переменную счетчик и увеличивайте ее на единицу, считывая очередное значение из файла
</details>
