## "Кассовый аппарат"

### Задание
Кассовый аппарат пишет цены всех проданных товаров в текстовый файл, наименование проданных товаров не имеет значение.

По окончанию рабочей недели имеем файл [data/sold.txt](data/sold.txt). \
Товары проданные в один день аппарат записывает на одной строке.

Узнайте:
1. На какую сумму было продано товаров
2. Цену самого дорогого товара
3. Цену самого дешевого товара

### Формат входных данных

Дан текстовый файл. На каждой строке записаны числа(целые или десятичные) разделенные одним или более пробелами.

Количество строк в файле произвольное.

### Формат выходных данных

Вывести:
1. На какую сумму было продано товаров
2. Цену самого дорогого товара
3. Цену самого дешевого товара

### Решение задачи

```python
# Совет: сначала считайте все цены из файла, сохраните в список,
# преобразовав каждую цену к числу(цены в файле хранятся в виде строк)
# А затем, работам с привычным списком, выполните задания
f = open("sold.txt", "r", encoding="utf-8")
prices = []
sum_goods = 0
max_price_goods = 0
min_price_goods = 0

for line in f:
    numbers = [float(el) for el in line.split()]
    for i in numbers:
        prices.append(i)
sum_goods = sum(prices)
max_price_goods = max(prices)
min_price_goods = min(prices)

print(f"Товаров было продано на сумму {sum_goods}")
print(f"Цена самого дорогого товара {max_price_goods}")
print(f"Цена самого дешевого товара {min_price_goods}")

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Для преобразования строки в список вспомните про метод строки .split()

```python
line = "2 4 6 8"
numbers_str = line.split()  # numbers_str = ["2", "4", "6", "8"]
```
</details>

<details>
<summary>Подсказка-2</summary>
Самый простой способ, для преобразования списка строк к списку чисел:

```python
numbers_str = ["2", "4", "6", "8"]
numbers = []
# Пройтись по списку строк:
for el in numbers_str:
    # Каждый элемент списка преобразовать к строке
    number = int(el)
    # и добавить его в новый список
    numbers.append(number)
# numbers = [2, 4, 6, 8]
```
</details>

<details>
<summary>Подсказка-3</summary>
Для объединения списков можно воспользоваться операцией +

```python
list1 = [2, 4, 6]
list2 = ["p", "l"]
list1 += list2  # list1 = [2, 4, 6, "p", "l"]
```
</details>

<details>
<summary>Подсказка-4</summary>
Можете воспользоваться встроенными функциями или написать алгоритмы самостоятельно:

**sum(prices)** - сумма элементов списка prices \
**max(prices)** - максимальный элемент списка \
**min(prices)** - минимальные элемент списка \
</details>
