## "Кассовый аппарат"

### Задание
Кассовый аппарат пишет цены всех проданных товаров в текстовый файл, наименование проданных товаров не имеет значение.

По окончанию рабочей недели имеем файл [data/sold.txt](data/sold.txt). \
Товары проданные в один день аппарат записывает на одной строке.

Узнайте:
1. На какую сумму было продано товаров
2. Цену самого дорогого товара
3. Цену самого дешевого товара

### Формат входных данных

Дан текстовый файл. На каждой строке записаны числа(целые или десятичные) разделенные одним или более пробелами.

Количество строк в файле произвольное.

### Формат выходных данных

Вывести:
1. На какую сумму было продано товаров
2. Цену самого дорогого товара
3. Цену самого дешевого товара

### Решение задачи

```python
path = "sold.txt"
file = open(path, "r")
min_price, max_price, summa = 0, 0, 0
for for_day in file:
    for price in for_day.split():
        price = float(price)
        summa += price
        if price < min_price or min_price == 0:
            min_price = price
        if price > max_price:
            max_price = price
print("Сумма:", summa)
print("Минимальная цена:", max_price)
print("Максимальная цена:", min_price)
file.close()```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Для преобразования строки в список вспомните про метод строки .split()

```python
line = "2 4 6 8"
numbers_str = line.split()  # numbers_str = ["2", "4", "6", "8"]
```
</details>

<details>
<summary>Подсказка-2</summary>
Самый простой способ, для преобразования списка строк к списку чисел:

```python
numbers_str = ["2", "4", "6", "8"]
numbers = []
# Пройтись по списку строк:
for el in numbers_str:
    # Каждый элемент списка преобразовать к строке
    number = int(el)
    # и добавить его в новый список
    numbers.append(number)
# numbers = [2, 4, 6, 8]
```
</details>

<details>
<summary>Подсказка-3</summary>
Для объединения списков можно воспользоваться операцией +

```python
list1 = [2, 4, 6]
list2 = ["p", "l"]
list1 += list2  # list1 = [2, 4, 6, "p", "l"]
```
</details>

<details>
<summary>Подсказка-4</summary>
Можете воспользоваться встроенными функциями или написать алгоритмы самостоятельно:

**sum(prices)** - сумма элементов списка prices \
**max(prices)** - максимальный элемент списка \
**min(prices)** - минимальные элемент списка \
</details>
