## "Улучшенный кассовый аппарат"

### Задание
Кассовый аппарат был доработан, теперь он пишет не только цены, но и тип проданных товаров. \
Файл [data/items_sold.txt](data/items_sold.txt) - продажи всех товаров за день. \
Каждая строка файла - покупка одного покупателя.

Узнайте:
1. Какова общая выручка магазина
2. Какова выручка магазина по каждому типу товаров
3. Какой тип товара был продан на самую большую сумму
4. Сколько различных типов товаров было продано за день

### Формат входных данных

Дан текстовый файл. На каждой строке записана информация о проданных товарах в формате:

**тип_товара:цена**, например **fruits:45.10**

Все проданные товары разделены одним или более пробелами.

### Формат выходных данных

Вывести:
1. Какова общая выручка магазина
2. Какова выручка магазина по каждому типу товаров
3. Какой тип товара был продан на самую большую сумму. Если таких несколько, вывести любой.
4. Сколько различных типов товаров было продано за день

### Решение задачи

```python
path = "items_sold.txt"
with open(path, "r") as file:
    min_price, max_price, summa, summa_by_type = 0, 0, 0, {}
    max_price_type, dif_count = "", 0
    for per_user in file:
        for bill in per_user.split():
            bill = bill.split(":")
            item_type = bill[0]
            price = float(bill[1])
            summa += price
            if item_type in summa_by_type:
                summa_by_type[item_type] += price
            else:
                summa_by_type[item_type] = price
            if price > max_price:
                max_price = price
                max_price_type = item_type
    print("1. Общая выручка:", summa)
    print("2. Выручка по каждому типу товара:", end=" ")
    print(*[f"{el[0]} = {el[1]}" for el in summa_by_type.items()], sep="\n" + " " * 35)
    print("3. Тип товара с самой высокой ценой:", max_price_type)
    print("3. Различных типов товаров было продано за день:", len(summa_by_type))
#    file.close()
```

---
