## "Улучшенный кассовый аппарат"

### Задание
Кассовый аппарат был доработан, теперь он пишет не только цены, но и тип проданных товаров. \
Файл [data/items_sold.txt](data/items_sold.txt) - продажи всех товаров за день. \
Каждая строка файла - покупка одного покупателя.

Узнайте:
1. Какова общая выручка магазина
2. Какова выручка магазина по каждому типу товаров
3. Какой тип товара был продан на самую большую сумму
4. Сколько различных типов товаров было продано за день

### Формат входных данных

Дан текстовый файл. На каждой строке записана информация о проданных товарах в формате:

**тип_товара:цена**, например **fruits:45.10**

Все проданные товары разделены одним или более пробелами.

### Формат выходных данных

Вывести:
1. Какова общая выручка магазина
2. Какова выручка магазина по каждому типу товаров
3. Какой тип товара был продан на самую большую сумму. Если таких несколько, вывести любой.
4. Сколько различных типов товаров было продано за день

### Решение задачи

```python
path = "items_sold.txt"
f = open(path, "r")

goods_revenu = {}
for line in f:
    for sold in line.split():
        good, price = sold.split(":")
        price = float(price)
        if good in goods_revenu:
            goods_revenu[good] += price
        else:
            goods_revenu[good] = price

print(f"Общая выручка магазина: {sum(goods_revenu.values()):.2f}")
print("Вручка магазина по каждому типу товаров: ")
for good, revenu in goods_revenu.items():
    print(f"Товар {good} - Выручка: {revenu:.2f}")
d = sorted(goods_revenu.items(), key=lambda x: x[-1])
print(f"На самую большую сумму продан {d[-1][0]} за {d[-1][1]:.2f}")
print(f"За день продано {len(goods_revenu.keys())} типа(ов) товаров")

f.close()

```

---
