## "Подсчет подстрок без учета регистра"

### Задание

Подсчитать количество слов «мама»(без учета регистра) во введенной строке.

Т.е. вам подойдут слова и "мама" и "Мама" и "МАМа" и т.д.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество найденных слов.

### Решение задачи

```python
text = "Мама мыла раму. Устала мама, но наконец отмыла раму-)"
# TODO: you code here...
```
example = str(input("Insert your text: "))
example_low = example.lower()
example_find = example_low.find("мама")
x = 0
n = 0
while example_find > -1:
    n = example_find
    example_low = example_low[n+4:]
    x = x + 1
    example_find = example_low.find("мама")
print(x)
---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
