## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"
# TODO: you code here...
```
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"
text.lower()

summa = 0
n = 0

while n < len(vowels):
    summa += text.count(vowels[n])
    n += 1
print(summa, "сумма гласных")
---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
