## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"
# TODO: you code here...
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"

i = 0
count = 0
while i < len(vowels):
    count += text.count(vowels[i])
    i += 1

print(count)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
