## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"

steps = len(vowels)
_sum=0

while steps:
    _sum += text.count(vowels[steps-1])
    steps -= 1

print(_sum)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
