## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"

i = 0
count_vowels = 0
while i < len(text):
    if vowels.find(text[i:i+1]) != -1:
        count_vowels += 1
    i += 1

print(count_vowels)

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
