## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"
# TODO: you code here...
```
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"
counter = 0
j = 0
while j < len(vowels):
    counter += text.count(vowels[j])
    #print(vowels[j])
    j += 1
print(counter)
---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
