## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
text = input("Введите текст: ")
vowels = "ауоыэяюёие"
n = len(vowels)
print(n)
i = 0
text = text.lower()
summa = 0

while i < n:
    amount = text.count(vowels[i])
    i += 1
    summa += amount
print("Количество гласных: ", summa)

```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
