## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
text = "В теории, теория и практика неразделимы. На практике это не так."
vowels = "ауоыэяюёие"

vowels_counter = 0
i = 0
while i < len(vowels) :
    vowels_counter += text.lower().count(vowels[i])
    i += 1
print(vowels_counter)


```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
