## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
s="ПодсчЕт гласных бУкв"
vowels = "ауоыэяюёие"
i=0
tot=0
while i<len(vowels):
    tot+=s.lower().count(vowels[i])
    i+=1
print(tot)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
