## "Подсчет гласных букв"

### Задание

Подсчитать количество гласных(русских) букв во введенной строке без учета регистра.

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество гласных букв.

### Решение задачи

```python
string = input("String: ")
string = string.lower()

number_of_vowels = 0
vowels = ['а', 'ё', 'у', 'е', 'ы', 'я', 'о', 'э', 'и', 'ю']

for letter in vowels:
    number_of_vowels += string.count(letter)

print(number_of_vowels)

```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Преобразуйте исходную строку к нижнему регистру воспользовавшись соответствующим методом.
</details>
