## "Функция: Сжатие данных(RLE)"

### Описание алгоритма RLE(run-length encoding)

Кодирование длин серий (RLE) — это простая форма сжатия данных без потерь,
которая выполняется для последовательностей с одним и тем же значением,
повторяющимся много раз подряд. Он кодирует последовательность
для хранения только одного значения и его количества.

Например, рассмотрим строку: \
`aaaabbcccccccddddgggggggggggg`

С помощью алгоритма RLE, ее можно сжать в такую: \
`4a2b7c4d12g`

Т.е. мы просто считаем количество одинаковых символов подряд и вместо `aaaa` -> `4a`

### Задание

Дана строка символов. Напишите функцию, кодирующую данную строку алгоритмом RLE.

### Формат входных данных

Дана произвольная строка символов.

### Формат выходных данных

Написать функцию кодирования исходной строки.

### Решение задачи

```python
def rle_encode(string: str) -> str:
    # TODO: you code here...
    ...

base_str = input("Введите строку символов: ")
result_str = rle_encode(base_str)
print("Строка закодированная алгоритмом RLE:", result_str)
```

