## "Пропуск некорректных данных"

### Задание

Дан файл [data/info.txt](data/info.txt), в каждой строке которого содержится строка или целое число. \
Найдите сумму всех чисел, пропуская все строки, которые нельзя преобразовать к типу int.

### Формат входных данных

Дан текстовый файл, на каждой строке которого целое число или произвольный текст.

### Формат выходных данных

Программа ничего не выводит в терминал, все сообщения записываются в указанный файл или в файл по умолчанию.

### Решение задачи

```python
summa = 0
with open("info.txt", "r") as f:
    for line in f:
        cut_line = line.replace('\n', '')
        if cut_line.replace('-', '', 1).isdigit():
            summa += int(cut_line)

print(f"Сумма чисел = {summa}")
```

---
