## "Вывод в файл: Пирамида"

### Задание

Выведите в файл **pyramid.txt** пирамиду из n строк.

Пример:
```
n = 5
    *
   ***
  *****
 *******
*********
```
```
n = 6
     *
    ***
   *****
  *******
 *********
***********
```
**Пояснение**: в каждой строке символов на два больше, чем в предыдущей, символы выровнены по центру по длине самой нижней строки.
### Формат входных данных

Дано целое положительное число, высота(количество строк) пирамиды.

### Формат выходных данных

Программа ничего не выводит в терминал, все символы для отображения пирамиды выводим в файл.

### Решение задачи

n = int(input("n: "))

with open("pyramid.txt", "a+") as f:
    f.seek(0)  # перемещаемся в начало файла
    content = f.read()  # считываем содержимое файла
    width = 2*n - 1  # ширина самой широкой строки
    lines = []
    for i in range(1, n+1):
        stars = "*" * (2*i - 1)
        line = stars.center(width)
        lines.append(line)
    output = "n=" +  str(n) + "\n" + "\n".join(lines)  # значение n в начало строки
    f.write("\n\n")  # отступ
    f.write(output)
    print(output).
```

---
<details>
<summary>Подсказка-1</summary>
Вспомните про форматирование строк

```python
line = "**"
print(f"{line:^8}")
```
</details>
