## "Вывод в файл: Пирамида"

### Задание

Выведите в файл **pyramid.txt** пирамиду из n строк.

Пример:
```
n = 5
    *
   ***
  *****
 *******
*********
```
```
n = 6
     *
    ***
   *****
  *******
 *********
***********
```
**Пояснение**: в каждой строке символов на два больше, чем в предыдущей, символы выровнены по центру по длине самой нижней строки.
### Формат входных данных

Дано целое положительное число, высота(количество строк) пирамиды.

### Формат выходных данных

Программа ничего не выводит в терминал, все символы для отображения пирамиды выводим в файл.

### Решение задачи

n = int(input("n: "))

with open("pyramid.txt", "w") as f:
    max_length = n * 2
    i = 1
    while i <= n * 2:
        line = "*" * i
        f.write(line.center(max_length, " ") + "\n")
        i += 2
    f.close()


<details>
<summary>Подсказка-1</summary>
Вспомните про форматирование строк

```python
line = "**"
print(f"{line:^8}")
```
</details>
