## "Обработка списка фруктов"

### Задание

Дан файл [data/fruits.txt](data/fruits.txt) со списком фруктов. \
Записать в новые файлы все фрукты, начинающиеся с определенной буквы. \
Т.е. в одном файле будут все фрукты на букву “А”, во втором на “Б” и т.д. \
Файлы назвать соответственно.
Пример имен файлов: fruits_А.txt, fruits_Б.txt, fruits_В.txt …. \
Важно! Обратите внимание, что нет фруктов, начинающихся с некоторых букв, а также есть пустые строки, которые нужно пропустить. \
**Не гарантируется**, что фрукты идут по алфавиту. Т.е. сначала может быть фрукт на букву "В", а потом идти на букву "Б" \
Напишите универсальный код, который будет работать с любым списком фруктов и распределять по файлам в зависимости от первых букв, имеющихся в списке фруктов.

### Формат входных данных

Дан текстовый файл, на каждой строке которого или название фрукта, или пустая строка.

### Формат выходных данных

Записать названия фруктов в разные файлы в соответствии с условием задачи.

### Решение задачи

f = open("data/fruits.txt", "r", encoding="UTF-8")

fruits = []
for line in f:
    if line.strip() != "":
        fruits.append(line.strip())
f.close()
fruits.sort()

first_char = ""
for fruit in fruits:
    if fruit[0] != first_char:
        f.close()
        file_name = f"fruits_{fruit[0]}.txt"
        f = open(file_name, "a", encoding="UTF-8")
        f.write(fruit + "\n")
        first_char = fruit[0]
    else:
        f.write(fruit + "\n")

### Подсказки

<details>
<summary>Подсказка-1</summary>
Возможно пригодится:

Чтобы получить список больших букв русского алфавита:
```python
print(list(map(chr, range(ord('А'), ord('Я')+1))))
```

</details>
