# ========================================
#  Несколько слов об обработке исключений
# ========================================

# Когда python не может выполнить операцию (инструкцию), то вызывается ошибка (исключение).
# Такие исключения можно перехватывать и обрабатывать так, как вам это нужно.

# n = 10
n = 'Hello'

try:
    n = int(n)
    print('n успешно преобразована к типу Int')
except ValueError:  # Тип перехватываемого исключения
    print('значение n невозможно преобразовать к типу int')
# except OtherError:  except'ов может быть любое кол-во, если вы хотите разные ошибки обрабатывать по-разному
# except (ValueError, TypeError, FloatingPointError): или в виде перечисления

# В python использование обработки исключений как части алгоритма является нормальным, но старайтесь не злоупотреблять.

# Подробнее об исключениях см.в справочнике
