# Открываем файл на запись. "w" - write(запись)
# encoding - кодировка файла
f = open("files/data_write.txt", "w", encoding="UTF-8")
# Важно: открытие несуществующего файла на запист - создает его, а существующего - очищает его содержимое

# Через переменную f выполняем операции с файлом
# .readline() - считывает одну строку из файла
f.write("Строка такста!\n")  # символ переноса строки(\n) нужно записывать явно

# Если нужно записать, например числа из списка в файл:
items_cost = [123.5, 1242.45, 362, 4562.0]

for cost in items_cost:
    # Преобразовываем значения списка к строке
    cost_str = str(cost) + '\n'
    # Записываем в файл
    f.write(cost_str)
# По окончании работы с файлом - закрываем его.
f.close()
