# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
# Иван, Ирина, Вячеслав, Василий, Петр
i = 0
for name in names:
    print(names[i], ",", end=" ")
    i = i + 1
