# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

line = ", ".join(names)
print(line)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
