# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

total = ""
i = 0
while i < len(names):
    total += names[i]
    if i + 1 < len(names):
        total += ", "
    i += 1
print(total)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
