# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]


names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
string = ""
len = len(names)
el = 1
for name in names:
    if el < len:
        string += name + ", "
        el += 1
string += name
print(string)



# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
