# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
for name in names:
    if names.index(name) != len(names) - 1:
        print(name + ",", end = " ")
    else:
        print(name, end=" ")

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
