# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here

for i, name in enumerate(names, 1):
    print(f"{name}", end="")
    if i != len(names):
        print(",", end="")
    
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
