# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here
names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
comma = ", "
comma = comma.join(names)
print(comma)
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
