# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
finish = ""
for name in names:
    finish += name+","
print(finish[:-1])


# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
