# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
str = ''
for index in names:
    str = str + index + ","
n = len (str)
print(str[0:n-1])
