# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

all_names = ""
for name in names:
    all_names += name + ", "

print(all_names[:-2])


# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
