# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
string = ""
for name in names:
    string += name + " "
print(string)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
