# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here
print(*names, sep=", ")
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
