# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

for name in names:
    print(name, end=", ")

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
