# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]


names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
names_string=names[0]
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
for num, name in enumerate(names[1:]):
    names_string = names_string+ ", " +  name
print(names_string)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
