# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# print(type(names))

print(names[0], names[1], names[2], names[3], names[4], sep=", ")

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
