# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

print (f"{names[0]}, {names[1]}, {names[2]}, {names[3]}, {names[4]}")

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
