# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

for name in names:
    print(name+",", end = " ")

# TODO: your code here

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
