# Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random
numbers = []
# print(random.randint(10, 20))  # раскомментируйте, чтобы посмотреть работу функции randint
from random import randint
n = int(input("Количество элементов в списке: "))
numbers = []
for i in range(n):
    numbers.append(randint(-100, 100))
print(numbers)
