# Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random

number = int(input("Введите количество элементов: "))
numbers = []
i = 1

while i <= number:
    numbers.append(random.randint(-100, 100))
    i += 1

print(numbers)
