# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -100 до 100.
# Вывести на экран сумму всех положительных элементов кратных двум.

my_list = [-3, -2, -1, 0, 1, 2, 3, 4, 5, 6]
summa = 0
for num in my_list:
    if num > 0 and num % 2 == 0:
        summa += num
print(summa)
