# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -100 до 100.
# Вывести на экран сумму всех положительных элементов кратных двум.

total = 0
for number in numbers:
    if number > 0 and number % 2 == 0:
        total += number
print(total)
