# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -100 до 100.
# Вывести на экран сумму всех положительных элементов кратных двум.

numbers = [-79, 82, 42, 9, -51, -6, 43, -86, 42, -28, -69, 41, 19, -38, -76, 56, 1, 21, 82, -69]
total = 0
for i in range(len(numbers)):
    if numbers[i] > 0 and numbers[i] % 2 == 0:
        total += numbers[i]
print("Сумма всех положительных элементов кратных двум = ", total)
