# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -100 до 100.
# Вывести на экран сумму всех положительных элементов кратных двум.

nums = [1, 4, -5, 7, -1]
total = 0

for num in nums:
    if num > 0 and num % 2 == 0:
        total += num

print(total)

