# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример:
# Дано: [2, -5, 8, 9, -25, 25, 4]
# Результат: [3, 5, 2]
import random

n = int(input('Введите количество элементов: '))

BEGINNING = -100
FINISH = 100
numbers = []
i = 1

while i <= n:
    numbers.append(random.randint(BEGINNING, FINISH))
    i += 1
print('Список произвольных элементов:')
print(numbers)

results = []

for j in numbers:
    if j > 0 and ((j ** 0.5) * 10) % 10 == 0:
        results.append(int(j ** 0.5))
print()
print('Результат: ', results)
