# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример:
numbers = [2, -5, 8, 9, -25, 25, 4, 0]
res = []

for i in numbers:
    if int(i) >= 0 and int(i)**0.5 % 1 == 0:
            res.append(int(i**0.5))
print(res)

# Результат: [3, 5, 2]
