# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример:
# Дано: [2, -5, 8, 9, -25, 25, 4]
# Результат: [3, 5, 2]
import random

n = 50

numbers = [2, -5, 8, 9, -25, 25, 4]
i = 1
while i <= n:
    numbers.append(random.randint(-100, 100))
    i += 1

res = []
for el in numbers:
    if el > 0:
        sq_el = el ** 0.5
        if sq_el % 1 == 0:
            res.append(int(sq_el))
print(numbers)
print(res)
