# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here
names = ["Иван", "Ирина", "Вячеслав", "флыовраффыы", "Василий", "Петр", "Петр"]

max_n = ""

for n in names:

    if len(n) > len(names):
      max_n = n

print("Самое длинное", max_n)
