# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

lid_name = ""
for name in names:
    if len(name) > len(lid_name):
        lid_name = name

print("Первое самое длинное имя:", lid_name)

