# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# numbers = [-10, 9, 8, -5, 10, 0, -3, 7]
summ = sum(numbers)
print(summ)
