# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

list_num = [5, -5, 9, 1, -4, -4]
summa = 0
for i in list_num:
    summa += i
print("Сумма элементов равна ", summa)
