# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
number_list = [-10, 0, 1, 5, -7, -9, 8, 4]
print(sum(number_list))
