# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list = [1,2,3,4,-1,-5,-6,10]

sum_list = 0
for var in my_list:
    sum_list += var

print(sum_list)
