# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [10, 5, 2, 0, 8, 1, 3, 10]
sum = 0
for element in numbers:
    sum += element
print(sum)
