# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
my_list = [-2, 0, 4,-10, 8, 6]
total = 0
for number in my_list:
    total += number
print(total)
