# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [12, 14, 22, 32]

i = 0
s = 0
for number in numbers:
    s = s + numbers[i]
    i = i + 1
print(s)

