# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO:
list = [-10,-8,-5,-1,6,7.5,10]
sum=0
for symvol in list:
    sum=float(symvol)+sum
print(sum)
