# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

nums = [1, 4, -5, 7, -1]
total = 0

for i in nums:
    total += i

print(total)
