# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

n = [-10, -8, -7, 2, 3, 5, 6, 8, 9, 10]
sum_n_values = sum(n)
print("Сумма всех элементов списка:", sum_n_values)
