# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: 
n = [-10, -5, -4, 0, 1, 2]
total = 0

for n1 in n:
    total += n1
print(total)
