# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list = [-1, -2, 0, 3, 10]
summa=0
for elem in my_list:
    summa=summa+elem
print (summa)
