# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

n = int(input("Введи количество:"))
total = 0
for i in range(n):
    total += int(input("Число -"))
print("Сумма всех введенных чисел =", total)
