# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [-5, 6, 9, 3, -3]
total = 0
for n in numbers:
    total += n
print(total)
