# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
my_list = [-10, 9, 0, 4, 10, -3, 5, 9, -7, 8]

total = 0

for i in my_list:
    total += i

print(total)
