# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

list_1 = [-10,5,3,5,7]

count = 0
for el in list_1:
    count = count + el
print("Cумма ряда в списке равна:", count)
