# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = ['-10', '-3', '0', '2', '5', '10']
summ = 0

for elem in numbers:
    elem = int(elem)
    summ = elem + summ

print(summ)
