# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [5, 4, 0, -3, 10, 7, 3, -2, 9]
sum = 0
for number in numbers:
    sum = sum + number
print(sum)
