# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

number = [2, 5, -6, 0, 7, 0, 15, 8, 2,-50]

print(sum(number))
