# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

import random

num_list = [random.randrange(-10, 10) for _ in range(int(input("Введите кол-во элементов: ")))]
print("Получился список: ", num_list))
print("Сумма элементов списка: ", sum(num_list))
