# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

summa = 0
for i in [-10, -2, 5, 9, 0]:
    summa += i
print(summa)
