# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

#-10 до 10
# for i in range(21):
#     list_num.append(-10+i)

list_num = [1,2,3,4,-6,7,8,-5,19]

print(sum(list_num))

