# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
my_list = [2, 5, 7, 13]
total = 0
for element in my_list:
    total += element
print(total)
