# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

my_list = [1, 2, 4, 8, -3, 5]
summa = 0
for element in my_list:
    if element > 0:
        summa += element

print("Сумма:", summa)

