# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

n = [-10, -8, -7, 2, 3, 5, 6, 8, 9, 10]
positive_sum = 0

for value in n:
    if value > 0:
        positive_sum += value

print("Сумма всех положительных элементов списка:", positive_sum)
