# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

n = int(input("Введи количество:"))
total = 0
for i in range(n):
    x = int(input("Число:"))
    if x > 0:
        total += x
print("Сумма всех введенных положительных чисел =", total)
