# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

# TODO: your code here
# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.


summa = 0
numbers = [2, 10, 0, -9, 23, -5, 0, 5, -10]
for number in numbers:
    if number > 0:
        summa += number
print(summa)
