# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

list_num = [1,2,3,4,-6,7,8,-5]
sum_pos_num = 0

for num in list_num:
    if num>0:
        sum_pos_num+=num

print(sum_pos_num)
