# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

numbers = [-5, 6, 9, 3, -3]
total = 0
for n in numbers:
    if n >= 0:
        total += n
print(total)
