# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

numbers = [-10, 10, 5, 5]

i = 0
s = 0
for number in numbers:
    if numbers[i] > 0:
        s = s + numbers[i]
    i = i + 1
print(s)

