# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

list_num = [10, -5, 0, 3, 6, -10]
sum = 0
for num in list_num:
    if num > 0:
        sum += num
print(sum)
