# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

num = [-4,-1,0,2,5,7,10]
summ = 0
for nums in num:
    if nums % 2 == 0:
        summ += nums
print(f"сумма = {summ} для положительных чисел списка: {num}")
