# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

numbers = [4, -5, 9, -2, -4, 9, 0, -3, 4, 5]
summa = 0

for number in numbers:
    if number > 0:
        summa += number
print(summa)
