# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

total = 0
for number in array:
    if number > 0:
        total += number

print(total)
