# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

n = [-10, 5, 2, 10]
sum = 0
i = 1
for n_n in n:
    #print(i, n_n)
    if n_n >= 0:
        sum = sum + n_n
        i = i + 1
print(sum)
