# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

numbers = [10, -5, 2, -9, -3, 8]
summa = 0
cnt = 0
while cnt < len(numbers):
    if numbers[cnt] > 0:
        summa += numbers[cnt]
    cnt += 1
print('Сумма положительных чисел:', summa)
