# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

# TODO: your code here

n_list = [1, 2, 3, 4, -5]

i = 0
summ = 0
while i < len(n_list):
    if n_list[i] > 0:
        summ += n_list[i]
    i += 1

print(summ)
