# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

numbers = [-3, 2, 0, 3, -8, 10]
summa = 0
for i in numbers:
    if i > 0:
        summa = summa + i
print(summa)
