# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

y_list = [-2, 4, -5, 7, 3, 1]

total = 0

for n in my_list:
    if i > 0:
        total = n + total
        
print(f"{total}")
