# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]
i = 1
max_len = 0
delta_len = 0
sep = ' '
for el in fruits:
    if len(el) > max_len:
        max_len = len(el)
for el in fruits:
    print(f'{i}. {sep * (max_len - len(el))}{el}')
    i += 1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
