# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

fruits = ["яблоко", "банан", "киви", "арбуз"]
count = 1
max_length = 0
for fruit in fruits:
    if len(fruit) > max_length:
        max_length = len(fruit)
for fruit in fruits:
    print(count, (max_length - len(fruit))*' ', fruit)
    count += 1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
