# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
'''
fruits = ["яблоко", "банан", "киви", "арбуз"]
word_max_len = len(max(fruits))
i = 1

for fruit in fruits:
    print(i, '. ', fruit.rjust(word_max_len), sep = '')
    i += 1

'''
# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
