# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз", "абрикос"]
max_len = 0
for i in fruits:
    if max_len < len(i):
        max_len = len(i)
ind = 1
for i in fruits:
    print(str(ind) + ".", i.rjust(max_len))
    ind += 1


# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
