# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

fruits = ["яблоко", "банан", "киви", "ананас", "груша"]
num = 1
max = 0
for fruit in fruits:
    if len(fruit) > max:
        max = len(fruit)
for fruit in fruits:
    print(f'{num}. {fruit.rjust(max)}') #rjust Делает длину строки не меньшей max
    num += 1


# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
