# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]
len_word_max = 0
for fruit in fruits:
    if len_word_max < len(fruit):
        len_word_max = len(fruit)

for i, fruit in enumerate(fruits, 1):
    print(i, fruit.rjust(len_word_max, " "))

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
