# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here
fruits = ["яблоко", "банан", "киви", "арбуз"]
max_long = max(fruits, key=len)
long_dig=0
for dig in max_long:
    long_dig+=1
i = 0
for fruit in fruits:
    i += 1
    print(i, ".", fruit.rjust(long_dig))

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
