# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

fruits = ["яблоко", "банан", "киви", "ананас", "груша", "абрикос"]
len_word=0
for val in fruits:
    if len(val)>len_word:
        len_word=len(val)
for val in fruits:
    print(fruits.index(val)+1,". ", val.rjust(len_word," "),sep="")

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
