# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:


fruits = ["яблоко", "банан", "киви", "арбуз", "sdfsdfsdfs"]
fruits_len = []
for fruit in fruits:
    fruits_len.append(len(fruit))
print(fruits_len)
print(max(fruits_len))
for fruit in fruits:
    print(fruits.index(fruit) + 1, fruit.rjust(max(fruits_len), " "))

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
