# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

max_len_world = 0
for fruit in fruits:
    if len(fruit) > max_len_world:
        max_len_world = len(fruit)
for i, fruit in enumerate(fruits, 1):
    print(i, fruit.rjust(max_len_world, ' '))


# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
