# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: 
fruits = ["яблоко", "банан", "киви", "арбуз","черешенка"]
max_len=0
for fruit in fruits:
        if max_len < len(fruit):
           max_len = len(fruit)
print(max_len)
i=1
for fruit in fruits:
    otstup=((max_len-1)//len(fruit))*"_"
    print(i,otstup+fruit+otstup)
    i+=1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
