# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]
max_length = 0
i = 1
for fruit in fruits:
    length = len(fruit)
    if max_length < length:
        max_length = length
for fruit in fruits:
    length = len(fruit)
    print(i, (max_length - length) * " ", fruit)
    i += 1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
