# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here

fruits = ["яблоко", "банан", "киви", "ананас", "груша","XXXXXXXXX"]

maxlen = len(fruits[0])

for elem in fruits:
    if len(elem) > maxlen:
        maxlen = len(elem)

counter = 1

for elem in fruits:
    #print(f"{counter},{elem:>12}")
    print(f"{counter},{elem.rjust(maxlen+1)}")
    counter += 1
    
# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
