# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

fruits = ["яблоко", "банан", "киви", "арбуз"]
max_length = 0
for fruit in fruits:
    if len(fruit) > max_length:
        max_length = len(fruit)
for fruit in fruits:
    if len(fruit) < max_length:
        fruits[fruits.index(fruit)] = " " * (max_length - len(fruit)) + fruit
i = 0
for fruit in fruits:
    i += 1
    print(i,"." , fruit)

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
