# Дан кортеж заполненный целыми числами
# Найдите самый большой элемент кортежа
tup = (2, 4, 6, -4, 12, 0, 5)

# TODO: your code here
tup = (2, 4, 6, -4, 12, 0, 5)
max_dig = 0
for dig in tup:
    if dig > max_dig:
        max_dig = dig
print(max_dig)
