# Дан кортеж заполненный целыми числами
# Найдите самый большой элемент кортежа
tup = (2, 4, 6, -4, 12, 0, 5)

tup = (2, 4, 6, -4, 12, 0, 5)
max_element = max(tup)
print("Максимальный элемент кортежа: ", max_element)
