# Дан кортеж заполненный целыми числами
# Найдите самый большой элемент кортежа
tup = (2, 4, 6, -4, 12, 0, 5)
max_number = max(tup)
print("Наибольшее число:", max_number)

# TODO: your code here
