# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

# TODO: your code here
tup0 = (2, 4, 6, -4, 12, 0, 5, 7)
tup1 = (2, 4, 6, -4, 12, 0, 5)
tup2 = (4, 6, -4, 12, 0, 5)

sumall = len(tup0) + len(tup1) + len(tup2)
print(sumall)
