# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

c1 = (3, 5, 7)
c2 = (5, -3, 6)
c3 = (1, 1, 1, 1, 1, 1, 1, 5)
cnt = 0
for el in c1:
    print(type(el))
    if el in c2 and el in c3:
        cnt += 1
print(cnt)
