# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

a = (3, 5, 7,-3)
b = (5, -3, 6)
c = (2, 3, -3, 1, 1, 5)
i = 0
for el in a:
    if el in b and el in c:
        i += 1
print(i)
