# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

tup1 = (2, 4, 6, -4, 12, 0, 5)
tup2 = (2, 4, 6, -4, 12, 0, 5)
tup3 = (2, 4, 6, 0, 12, 0)
k=0
for i in tup1:
    if i in tup2 and i in tup3:
        k+=1
print(k)
