# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

tup1 = (2, 4, -6)
tup2 = (2, 5, 8, -4, -6)
tup3 = (-10, 8, 2, 4, -6)

count_rep = 0

for i in tup1:
    if i in tup2 and i in tup3:
        count_rep += 1

print(count_rep)

