# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

tup1 = (1, 5, 9, 3, 6, 56, 43)
tup2 = (7, 1, 5, 45, 3, 64, 4153)
tup3 = (1, 5, 45, 3, 6, 56, 43)

n = 0
for el_tup in tup1:
    if el_tup in tup2 and el_tup in tup3:
        n += 1
print(n)
