# Дан список из элементов x = [-2,-1,0,1,2,3,4,5,6,7] - это координаты х, точек лежащих на прямой
# описываемой уравнением y=2x-4).
# Получить и вывести на экран список координат y для данного уравнения прямой.

# TODO: your code here
x = [-2,-1,0,1,2,3,4,5,6,7]
y1 = []
y2 = []
for i in x:
    y1 += [2*i-4]
    y2 += [(i,2*i-4)]
print(y1)
print(y2)
