# Пользователь вводит на экран дату в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.

# Подсказка: создайте списки с названием дней и названиями месяцев
# Примечание: для экономии времени, можно ограничить номер дня десятью.
# Примечание: склонениями названий можно принебречь

days = ("Первое", "Второе", "Третье", "Четвёртое", "Пятое",
        "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое",
        "Одиннадцатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое",
        "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое",
        "Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четвёртое", "Двадцать пятое",
        "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое",
        "Тридцать первое")
months = ("января", "февраля", "марта", "апреля", "мая", "июня",
          "июля", "августа", "сентября", "октября", "ноября", "декабря")

new_date = input("Введите дату в формате dd.mm.yyyy : ")

day = days[int(new_date[:2]) - 1]
month = months[int(new_date[3:5]) - 1]
year = new_date[6:]

print(f"{day} {month} {year} года")
