# Пользователь вводит на экран дату в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.

# Подсказка: создайте списки с названием дней и названиями месяцев
# Примечание: для экономии времени, можно ограничить номер дня десятью.
# Примечание: склонениями названий можно принебречь

string = str(input())

m_list = ("января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря")
d_list = ("первое", "второе", "третье", "четвёртое", "пятое", "шестое", "седьмое", "восемое", "девятое", "десятое", "одиннадцатое")

day = int(string[:2])
month = int(string[3:5])
year = string[6:]
print(d_list[day - 1], m_list[month - 1], year, "года")
