# Пользователь вводит на экран дату в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.

# Подсказка: создайте списки с названием дней и названиями месяцев
# Примечание: для экономии времени, можно ограничить номер дня десятью.
# Примечание: склонениями названий можно принебречь

date_in = input("Введите дату в формате dd.mm.yyyy: ")
day = date_in[0:2]
month = date_in[3:5]
year = date_in[6:]

day_words = [["01", 'первое'],["02", 'второе'],["03", 'третье'],["04", 'четвертое'],["05", 'пятое'], ["06", 'первое'], ["07", 'первое'], ["08", 'восьмое'], ["09", 'девятое'], ["10", 'десятое']]
month_words = [["01", 'января'],["02", 'февраля'],["03", 'марта'],["04", 'апреля'],["05", 'мая'], ["06", 'июня'], ["07", 'июля'], ["08", 'августа'], ["09", 'сентября'], ["10", 'октября'], ["11", 'ноября'], ["12", 'декабря']]
i = 0
while day_words[i][0] != day and i < len(day_words):
    i += 1
day_word = day_words[i][1]
i = 0
while month_words[i][0] != month and i < len(month_words):
    i += 1
month_word = month_words[i][1]

print (f"{day_word} {month_word} {year} года")
