## "Обратный отсчет"

### Задание

Выведите все целые числа от n до 0 включительно.

### Формат входных данных

Дано целое положительно число n.

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
number = int(input("Введите целое число: "))
a = number
b = 0
while a >= b:
    print("a =", a)
    a -= 1
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотрите в примерах "Вывод чисел в диапазоне [a, b]"
</details>
