## "Я учу питон"

### Задание

Выведите фразу "Я учу питон" n раз

### Формат входных данных

Дано целое положительное число n.

### Формат выходных данных

Вывести текст "Я учу питон" заданное количество раз.

### Решение задачи

```python
n = int(input("n: "))

# "Я учу питон"

n = int(input("Введите число n:"))
count = 0

while count < n:
    print("Я учу питон")
    count += 1
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотрите в примерах "Выполнение цикла n раз"
</details>
