## "Я учу питон"

### Задание

Выведите фразу "Я учу питон" n раз

### Формат входных данных

Дано целое положительное число n.

### Формат выходных данных

Вывести текст "Я учу питон" заданное количество раз.

### Решение задачи

n = int(input("Введите необходимое количество раз вывода фразы: "))
count = 0
while count < n:
    count += 1
    print("Я учу Питон")

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотрите в примерах "Выполнение цикла n раз"
</details>
