## "Четные из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **четные** числа от a до b включительно.

### Формат входных данных

Даны два целые числа. Гарантируется, что a < b.

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
a = int(input("a: "))
b = int(input("b: "))

print("Задайте числовой диапазон для переменной а и b")
a = int(input("Задайте число а:"))
b = int(input("Задайте число b:"))
if a < b:
    while b >= a:
        if a % 2 == 0:
            print(a)
        a += 1
else:
    print ("Число a больше числа b")
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Посмотрите в примерах "Вывод чисел в диапазоне [a, b], кратных трем"
</details>

<details>
<summary>Подсказка-2</summary>
Четное число - это число кратное двум, т.е. число, которое делится на два без остатка.
</details>
