## "Сумма четных чисел"

### Задание

Найдите сумму всех четных чисел от 0 до n.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести ответ в виде строки формата:

_Сумма четных чисел от 0 до 7 = 12_

### Решение задачи

```python

a = int(input("a: "))
b = int(input("b: "))
total = 0
while a <= b:
    if a % 2 == 0:
        total += a
    a += 1

print("Сумма чётных чисел =", total)

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотрите в примерах "Нахождение суммы чисел в диапазоне [a, b]"
</details>

<details>
<summary>Подсказка-2</summary>
Если хотите сохранить исходное значение переменной, создайте её копию

```python
a = 10
a_copy = a
```
</details>
