## "Сумма четных чисел"

### Задание

Найдите сумму всех четных чисел от 0 до n.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести ответ в виде строки формата:

_Сумма четных чисел от 0 до 7 = 12_

### Решение задачи

```python
n = int(input("Введите целое положительное число: "))
total = 0

if n % 2 != 0:
    temp_n = n - 1
else:
    temp_n = n
# temp_n - временная переменная для цикла

while temp_n > 0:
    total += temp_n
    temp_n -= 2

print("Сумма четных чисел от 0 до", n, "=", total)

```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотрите в примерах "Нахождение суммы чисел в диапазоне [a, b]"
</details>

<details>
<summary>Подсказка-2</summary>
Если хотите сохранить исходное значение переменной, создайте её копию

```python
a = 10
a_copy = a
```
</details>
