## "Подсчет положительных"

### Задание

Вводится n целых чисел. \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Сначала вводится целое положительное n. \
Далее вводится n целых чисел.

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
# TODO: you code here...
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Нахождение количества чисел кратных трем в диапазоне [a, b]"
</details>

<details>
<summary>Подсказка-2</summary>
Воспользуйтесь заготовкой кода, дописав недостающие строки:

```python
num = int(input("num: "))
count = 0
count_pos = 0

while count <= num:
    number = int(input())
    if number >=0:
        count_pos += 1
    count+=1
    
print("Было введено", count_pos, "положительных чисел")
```
</details>

