## "Подсчет положительных"

### Задание

Вводится n целых чисел. \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Сначала вводится целое положительное n. \
Далее вводится n целых чисел.

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
n = int(input("n: "))

even_numbers = 0
i = 0
while i < n:
    if int(input("number: ")) % 2 == 0:
        even_numbers += 1
    i += 1
print(f"количество положительных чисел = {even_numbers}")

```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Нахождение количества чисел кратных трем в диапазоне [a, b]"
</details>

<details>
<summary>Подсказка-2</summary>
Воспользуйтесь заготовкой кода, дописав недостающие строки:

```python
n = int(input("n: "))
i = 0
num_positive = 0  # Счетчик положительных чисел
while i < n:
    number = int(input("number: "))
    ...
    ...
    # TODO: you code here...
    i += 1
print("Было введено", num_positive, "положительных чисел")
```
</details>

