## "Подсчет положительных"

### Задание

Вводится n целых чисел. \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Сначала вводится целое положительное n. \
Далее вводится n целых чисел.

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
# TODO: you code here...
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Нахождение количества чисел кратных трем в диапазоне [a, b]"
</details>

<details>
<summary>Подсказка-2</summary>
Воспользуйтесь заготовкой кода, дописав недостающие строки:

```python
n = int(input("Введите количество чисел: "))
i = 1
count = 0

while i <= n:
    cur = int(input("Введите число: "))
    if cur > 0:
        count += 1
    i += 1
print('количество положительных чисел ', count)

```
</details>

