## "Подсчет положительных"

### Задание

Вводится n целых чисел. \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Сначала вводится целое положительное n. \
Далее вводится n целых чисел.

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
# "Подсчет положительных"
# Посчитайте количество положительных чисел, среди введенных.

n = int(input("Введите количество вводимых значений n:"))
count = 1
total = 0

while count <= n:
    st = "Введите значение числа номер " + str(count) + ": "
    current_value = int(input(st))
    if current_value > 0:
        total += current_value
    count += 1
print("Сумма всех положительных чисел из", n, "введённых:", total)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Нахождение количества чисел кратных трем в диапазоне [a, b]"
</details>

<details>
<summary>Подсказка-2</summary>
Воспользуйтесь заготовкой кода, дописав недостающие строки:

```python
n = int(input("n: "))
i = 0
num_positive = 0  # Счетчик положительных чисел
while i < n:
    number = int(input("number: "))
    ...
    ...
    # TODO: you code here...
    i += 1
print("Было введено", num_positive, "положительных чисел")
```
</details>

