## "Лесенка символами"

### Задание

Вывести лесенку из n ступенек символами *. \
Смотри пример.

### Формат входных данных

Дано целое число n, количество ступенек. 1 < n < 20

### Формат выходных данных

Вывести лесенку символами *(звездочка)

#### Примеры

n = 3 
```
*
**
***
```
n = 5
```
*
**
***
****
*****
```

### Решение задачи

```python
n = int(input("Кол-во ступенек: "))
step = ""
count_steps = 0

if 1 < n < 20:
    while count_steps < n:
        print(step + "*")
        step = step + "*"
        count_steps += 1
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Если строку умножить на число n, то строка дублируется n-раз:

```python
s = "0"
s = s * 5 # s = "00000" 
```
</details>
