## "Делители числа"

### Задание

Найдите все делители заданного числа.

### Формат входных данных

Дано целое положительное число.

### Формат выходных данных

Вывести все делители данного числа, кроме единицы и самого числа. \
Если делителей(отличных от единицы и самого числа) нет, то вывести "Число простое"

### Решение задачи

```python
# TODO: you code here...
```
# Делители числа
value = int(input("Set value: "))
i = 2
string_result = ''
while i < value:
    if value % i == 0:
        string_result += ' '+ str(i)
    i += 1
if len(string_result) > 0:
    print(string_result)
else:
    print("Число простое")

---

### Данные для самопроверки

| Дано | Результат |
| :---: | :--- |
|    4    | 2 |
|    8    | 2 4  |
|    11    | Число простое |
|    14    | 2 7  |
|    20   | 2 4 5 10  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Если одно число делится без остатка на другое, то второе называют — делителем первого
</details>

<details>
<summary>Подсказка-2</summary>
Самый простой способ решить данную задачу - просто перебрать все числа от 2-ки до заданного числа и проверить, делится ли заданное число на них без остатка.
</details>
