## "Делители числа"

### Задание

Найдите все делители заданного числа.

### Формат входных данных

Дано целое положительное число.

### Формат выходных данных

Вывести все делители данного числа, кроме единицы и самого числа. \
Если делителей(отличных от единицы и самого числа) нет, то вывести "Число простое"

### Решение задачи

n = int(input("n: "))

i = 2
result = ""

while i < n:
    if n%i == 0: result += str(i)  + " "
    i += 1

print(result if result != "" else "Число простое")

### Данные для самопроверки

| Дано | Результат |
| :---: | :--- |
|    4    | 2 |
|    8    | 2 4  |
|    11    | Число простое |
|    14    | 2 7  |
|    20   | 2 4 5 10  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Если одно число делится без остатка на другое, то второе называют — делителем первого
</details>

<details>
<summary>Подсказка-2</summary>
Самый простой способ решить данную задачу - просто перебрать все числа от 2-ки до заданного числа и проверить, делится ли заданное число на них без остатка.
</details>
