## "Делители числа"

### Задание

Найдите все делители заданного числа.

### Формат входных данных

Дано целое положительное число.

### Формат выходных данных

Вывести все делители данного числа, кроме единицы и самого числа. \
Если делителей(отличных от единицы и самого числа) нет, то вывести "Число простое"

### Решение задачи

```python
number = int(input("Введите число: "))
divisor = 2
is_simple = 1

while divisor < number:
    if number % divisor == 0:
        print(divisor)
        is_simple = 0
    divisor += 1

if is_simple == 1:
    print("Число простое")

```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | :--- |
|    4    | 2 |
|    8    | 2 4  |
|    11    | Число простое |
|    14    | 2 7  |
|    20   | 2 4 5 10  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Если одно число делится без остатка на другое, то второе называют — делителем первого
</details>

<details>
<summary>Подсказка-2</summary>
Самый простой способ решить данную задачу - просто перебрать все числа от 2-ки до заданного числа и проверить, делится ли заданное число на них без остатка.
</details>
