## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

```python
# Shershakov Grigoriy
number = int(input("n: "))
divisor = 0
summ_divisors = 0
while divisor < number:
    divisor += 1
    if number % divisor == 0 and divisor != number:
        summ_divisors += divisor
    else:
        summ_divisors += 0
if summ_divisors == number:
    print("Да")
else:
    print("Нет")
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
