## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

```python
# TODO: you code here...
```
# Это реально "потная катка" =)
number_a = int(input("Введите число А: "))
number_b = int(input("Введите число Б: "))

perfect_numbers = ""
summa_perfect_numbers = 0
while number_a <= number_b:
    summ_div = 0
    div = 1
    while div < number_a:
        if number_a % div == 0:
            summ_div += div
        div += 1
    if summ_div == number_a:
        perfect_numbers += str(number_a) + str(" ")
        summa_perfect_numbers += number_a
    number_a += 1
print("Список совершенных чисел в диапазоне от А до Б ", perfect_numbers)
print("Сумма всех совершенных чисел в диапазоне от А до Б равна= ", summa_perfect_numbers)
---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
