## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

```python
n = int(input("n:"))
divider = 2
dividers_sum = 1
while divider <= n / 2:
    if n % divider == 0:
        dividers_sum += divider
    divider += 1
if dividers_sum == n:
    print("Число", n, "- совершенное!")
else:
    print("Число", n, "- не совершенное!")

```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
