## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

```python
a = int(input("Начало диапазона "))
b = int(input("Конец диапазона "))
range_index = a
number_list = ""
number_count = 0
while range_index<=b:
    sum = 1
    ind = 2
    check = range_index // 2
    while ind <= check:
        if range_index % ind == 0:
            sum += ind
        ind += 1
    if sum == range_index:
        number_list += str(range_index)+" "
        number_count += 1
    range_index += 1
if number_count ==0 :
    print("В диапазоне ["+str(a)+","+str(b)+"] нет совершенных чисел")
else:
    print("Соверенных",number_count,"штук:",number_list)
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
