## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

```python
print("Все совершенные число в диапазоне")
a = int(input("Введите начальное число: "))
b = int(input("Введите конечное число: "))

count = 1
summa = 0
amount = 0

while a <= b:
    while count < a:
        if a % count == 0:
            summa += count
        count += 1
    if a == summa:
        print(a, end=" ")
        amount += 1
    count = 1
    summa = 0
    a += 1

print("Количество: ", amount)
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
