## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

```python
a = int(input('Введи  начало диапазона: '))
b = int(input('Введи  конец диапазона: '))

j = a
sum_perf = 0

while j <= b:
    num = j
    i = 1
    flag = 0
    sum_div = 0

    while i < num:
        if num % i == 0:
            sum_div += i
            flag = 1
        i += 1
    if sum_div == num:
        print('Совершенное число: ', num)
        sum_perf += 1

    j += 1

print('Количество совершенных чисел:', sum_perf)

```

---

### Подсказки
<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона, а внутренний проверять, является ли число совершенным.
</details>

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
