## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

```python
a = int(input("a: "))
b = int(input("b: "))
number = a
while number <= b:
    i = 1
    dividers_flag = False
    total = 0
    while i <= number:
        if (number % i == 0) and i != number:
            total += i
        i += 1

    if number == total:
        print(number, end=' ')
    number += 1
```

---

### Подсказки
<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона, а внутренний проверять, является ли число совершенным.
</details>

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
