## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

```
a, b = int(input("a: ")), int(input("b: "))

div_count = 0
div_list = ""

while a < b:
    divider = 1
    div_sum = 0
    while divider < a:
        if a % divider == 0:
            div_sum += divider
        divider += 1
    if div_sum == a:
        div_list += str(a) + " "
        div_count += 1
    a += 1
print(f'''Список чисел: {div_list} \n Кол-во чисел: {div_count}''')
```

---

### Подсказки
<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона, а внутренний проверять, является ли число совершенным.
</details>

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
