## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

n = int(input("n: "))

count = 0
a = 0

while a <= n:
    i = 1
    sum_a = 0
    while i < a:
        if a%i == 0: sum_a += i
        i += 1
    b = a + 1
    while b <= n:
        j = 1
        sum_b = 0
        while j < b:
            if b%j == 0: sum_b += j
            j += 1
        if a == sum_b and b == sum_a:
            print(a, " ", b)
        b += 1
    a += 1

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
