## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = int(input("n: "))
i = 1
while 0 < i <= n:
    j = 1
    while 0 < j <= n:
        if i == j or i == n + 1 - j:
            print("#", end ="")
        else:
            print(" ", end ="")
        j += 1
    print("")
    i += 1
```
