## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
n = int(input("n:"))
number_1 = 2
while number_1 <= n:

    divider = 2
    dividers_sum = 1
    while divider <= number_1 / 2:
        if number_1 % divider == 0:
            dividers_sum += divider
        divider += 1

    number_2 = dividers_sum

    divider = 2
    dividers_sum = 1
    while divider <= number_2 / 2:
        if number_2 % divider == 0:
            dividers_sum += divider
        divider += 1

    if (dividers_sum == number_1) and (number_1 < number_2):
        print(number_1, number_2)

    number_1 += 1

```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
