## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = int(input("n: "))

for i in range(1, n + 1):
    for j in range(1, n + 1):
        if i == j or j == n + 1 - i:
            print("#", end = "")
        else:
            print(" ", end = "")
    print()

```
