## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
# TODO: you code here...
n = int(input("n: "))

a = 1
while a <= n:
    div_summ_a = 0

    i = 1
    while i < a:
        if a % i == 0:
            div_summ_a += i
        i += 1

    b = 1
    while b < a:
        div_summ_b = 0

        i2 = 1
        while i2 < b:
            if b % i2 == 0:
                div_summ_b += i2
            i2 += 1
        if b == div_summ_a and a == div_summ_b:
            print(a, b)
        b += 1
#    print(a) #просто чтобы посмотреть как возрастает сложность вычисления, забавно
    a += 1
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
