## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
print("Диагонали символами")
n = int(input("Введите размер диагонали: "))
i = 0
k = n  # Количество пропусков по центру

while i < n:
    j = int((n - abs(k)) / 2)  # Количество пропусков по краям
    if k == 1 or k == 2:
        print(j * " " + k * "#")
        k -= 4
    else:
        print(j * " " + "#" + (abs(k) - 2) * " " + "#")
        k -= 2
    i += 1

```
