## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
# TODO: you code here...
```
n = int(input("n: "))

i = 1
while n > 0:
    if n > i:
        string = " "*i + "#" + " "*(n-i) + "#"
    else:
        string = " "*n + "#" + " "*(i-n) + "#"
    print(string)
    n -= 1
    i += 1
