## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = int(input("n:"))
i = 1
while i <= n:
    j = 1
    current_string = ""
    while j <= n:
        if i == j or n - i + 1 == j:
            current_string += "X"
        else:
            current_string += " "
        j += 1
    print(current_string)
    i += 1

```
