## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
def sum_of_denominators(x):
    result = 1
    i = 2
    while i < int(x / 2) + 1:
        if x % i == 0:
            result += i
        i += 1
    return result


def is_friendly(n1, n2):
    return n1 == sum_of_denominators(n2) and n2 == sum_of_denominators(n1)


n = int(input("n: "))

i = 1
pairs = []
while i < n:
    j = sum_of_denominators(i)
    if i == sum_of_denominators(j) and i != j:
        if (j, i) not in pairs:
            pairs.append((i, j))
    i += 1

for a, b in pairs:
    print(a, b)

```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
