## "Число Фибоначчи"

### Задание

По данному числу n определите n-е [число Фибоначчи](https://ru.wikipedia.org/wiki/%D0%A7%D0%B8%D1%81%D0%BB%D0%B0_%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8).

### Формат входных данных

Дано целое положительное число n, номер числа Фибоначчи в последовательности.

### Формат выходных данных

Вывести число Фибоначчи с номером n.


### Решение задачи

```python
n = int(input("n: "))

if n == 1:
    print(0)
elif n == 2:
    print(1)
else:    
    F_n_1 = 1
    F_n_2 = 0
    i = 3
    while i <= n:
        Fn = F_n_1 + F_n_2
        F_n_2 = F_n_1
        F_n_1 = Fn
        i += 1
    print(Fn)
```

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    1    | 0 |
|    4    | 2 |
|    7    | 8  |
|    11    | 55 |
