## "Число Фибоначчи"

### Задание

По данному числу n определите n-е [число Фибоначчи](https://ru.wikipedia.org/wiki/%D0%A7%D0%B8%D1%81%D0%BB%D0%B0_%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8).

### Формат входных данных

Дано целое положительное число n, номер числа Фибоначчи в последовательности.

### Формат выходных данных

Вывести число Фибоначчи с номером n.


### Решение задачи

```python
# TODO: you code here...
n = int(input("n: "))

#исключения для 1ых 2х чисел
if n != 0:
    print(0)
    print(1)
else:
    print(0)

n1 = 0
n2 = 1
summ = 0
i = 2
while i < n:
    if summ >= n:
        break
    summ = n1 + n2
    print(summ)
    n1 = n2
    n2 = summ
    i += 1


```

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    1    | 0 |
|    4    | 2 |
|    7    | 8  |
|    11    | 55 |
