## "Число Фибоначчи"

### Задание

По данному числу n определите n-е [число Фибоначчи](https://ru.wikipedia.org/wiki/%D0%A7%D0%B8%D1%81%D0%BB%D0%B0_%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8).

### Формат входных данных

Дано целое положительное число n, номер числа Фибоначчи в последовательности.

### Формат выходных данных

Вывести число Фибоначчи с номером n.


### Решение задачи

```python
n = int(input("n: "))
n_fibonacсi = 0

if n == 2:
    n_fibonacсi = 1
elif n > 2:
    i = 1
    n_minus1 = 0
    n_minus2 = 1
    while i < n:
        n_fibonacсi = n_minus1 + n_minus2
        i += 1
        n_minus1, n_minus2 = n_fibonacсi, n_minus1

print(n_fibonacсi)
```

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    1    | 0 |
|    4    | 2 |
|    7    | 8  |
|    11    | 55 |
