## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

n = int(input("n: "))

i = 0
while i < n:
    j = 0
    buff = ""
    while j < n:
        if j == i or j == (n - i - 1): buff += "*"
        else: buff += " "
        j += 1
    i += 1
    print(buff)
