## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = int(input("n: "))
i = 1

while i <= n:
    j = 1
    while j <= n:
        if j == i or j == n - i + 1:
            print("#", end="")
        else:
            print(" ", end="")
        j += 1
    print("")
    i += 1

```
