# Дано произвольное предложение. Слова разделены пробелами. Предложение содержит знаки препинания.
# Найдите:
# 1) первое слово из строки
# 2) первые два символа каждого слова
# 3) все слова начинающиеся на гласную букву
# 4) все слова начинающиеся на согласную букву
# 5) все уникальные(без дубликатов) знаки препинания

import re

text = "Пример произвольного предложения, содержащего знаки препинания! В нём есть слова, начинающиеся с гласных и согласных букв."

# первое слово из строки
first_word = re.findall(r'^\w+', text)[0]
print("Первое слово:", first_word)

# первые два символа каждого слова
first_two_chars = re.findall(r'\b\w{2}', text)
print("Первые два символа каждого слова:", first_two_chars)

# все слова начинающиеся на гласную букву
vowel_words = re.findall(r'\b[aeiouаеёиоуыэюяAEIOUаЕёИиОоУуЫыЭэЮюЯя]\w+', text)
print("Слова, начинающиеся на гласную букву:", vowel_words)

# все слова начинающиеся на согласную букву
consonant_words = re.findall(r'\b[^aeiouаеёиоуыэюяAEIOUаЕёИиОоУуЫыЭэЮюЯя\s]\w+', text)
print("Слова, начинающиеся на согласную букву:", consonant_words)

# все уникальные(без дубликатов) знаки препинания
punctuations = set(re.findall(r'[^\w\s]', text))
print("Уникальные знаки препинания:", punctuations)
