## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

n = int(input("Количество карточек: "))
sum_all = 0
sum_n = 0
i = n
# Цикл, который выполнится n-1 раз
while i > 1:
    card_number = int(input("Номер карточки: "))
    sum_n = sum_n + card_number
    i = i - 1
while n > 0:
    sum_all = sum_all + n
    n = n - 1
y = sum_all - sum_n
print("Номер потерянной карточки:", y)
