## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
a = int(input("Введите целое число а: "))
b = int(input("Введите целое число b: "))

if a > b:
    a = a + b
    b = a - b
    a = a - b

print("Числа в указанном интервале, кратные пяти: ")
while a <= b:
    if a % 5 == 0:
        print(a)
    a += 1
```
