## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
a = int(input("a: "))
b = int(input("b: "))

while a <= b:
    if a % 5 == 0:  # Если число кратно трем
        print(a)  # то выводим его
    a += 1
while b <= a:
    if b % 5 == 0:  # Если число кратно трем
        print(b)  # то выводим его
    b += 1

```
