## "Таблица умножение"

### Задание

Требуется вывести на экран двумерную таблицу умножения от 1 до n.

### Формат входных данных

Дано целое положительное число n. 1 < n < 9

### Формат выходных данных

Вывести таблицу умножения. Смотри пример.\
Если знаете как, выравняйте выводимые значения как в примере.

#### Пример
```
Входные данные
n = 5
Выходные данные
1  2  3  4  5  
2  4  6  8 10 
3  6  9 12 15 
4  8 12 16 20 
5 10 15 20 25
```

### Решение задачи

```python
n = int(input("От 1 до: "))

# Выводим первую строку таблицы
# for i in range(1, n+1):
i = 1
while i <= n:
    print('{:<3}'.format(i), end='')
    i += 1
print()

# Выводим остальные строки таблицы
# for i in range(2, n+1):
i = 2
while i <= n:
    j = 1
    while j <= n:
        # for j in range(1, n+1):
        print('{:<3}'.format(i * j), end='')
        j += 1
    print()
    i += 1
```

---

<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона [1, n], а внутренний выводить строку для каждого числа диапазона.
</details>

<details>
<summary>Подсказка-2</summary>
Чтобы выводить значение print'ами на одной строке, используйте:

```python
print(1, end=" ")
print(2, end=" ")
print(3, end=" ")
...
```
</details>
