## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи
n = int(input("Количество карточек: "))
n_summ = n * (n + 1) / 2
summ_cards = int()
i = 0


while i < n-1:
    card_number = int(input("Номер карточки: "))
    summ_cards += card_number
    i +=1
    
    
lost_card = int(n_summ - summ_cards)
print("Номер потерянной карточки:", lost_card)
```
