## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
#Shershakov Grigoriy
n = int(input("Количество карточек: "))
counter = 0
sum_all_cards = n*(n+1)/2
sum_number = 0
# Цикл, который выполнится n-1 раз
while counter < n - 1:
    card_number = int(input("Номер карточки: "))
    sum_number += card_number
    counter += 1
lost_card = int(sum_all_cards) - sum_number
print("Номер потерянной карточки:", lost_card)
```
