## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
# Цикл, который выполнится n-1 раз
while ...:
    card_number = int(input("Номер карточки: "))
    ...

print("Номер потерянной карточки:", ...)
```
n = int(input("Количество карточек: "))
sum_other_card = 0
sum_all_card = 0
i = 0
while i < n:
    i += 1
    sum_all_card += i
print("Сумма всех карточек = ", sum_all_card)

while n - 1 > 0:
    card_number = int(input("Номер карточки: "))
    sum_all_card = sum_all_card + card_number
    sum_other_card += n
    n -= 1
print("Сумма оставшихся карточек = ", sum_other_card)

print("Номер потерянной карточки:", sum_all_card - sum_other_card)
