## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи
n = int(input("Количество карточек: "))
s = 0
i = 1
j = 1
while i <= n:
    s += i
    i += 1
# Цикл, который выполнится n-1 раз
while j <= (n - 1):
    card_number = int(input("Номер карточки: "))
    s -= card_number
    j += 1
print("Номер потерянной карточки:", s)

```python
n = int(input("Количество карточек: "))
# Цикл, который выполнится n-1 раз
while ...:
    card_number = int(input("Номер карточки: "))
    ...

print("Номер потерянной карточки:", ...)
```

