## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

n = int(input("Количество карточек: "))
# Цикл, который выполнится n-1 раз
i = 1
sum_cards = 0
sum_all = 0
while i <= n-1:
    card_number = int(input("Номер карточки: "))
    sum_cards += card_number
    i += 1

i= 1
while i <= n:
    sum_all += i
    i += 1

print("Номер потерянной карточки:", sum_all - sum_cards)
