## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

n = int(input("Количество карточек: "))  
total_sum = n * (n + 1) // 2  # сумма всех номеров карточек
sum_left = 0  # сумма номеров оставшихся карточек

i = 1
while i < n:
    card_number = int(input("Номер карточки: "))
    sum_left += card_number
    i += 1

# Найдем номер потерянной карточки как разность сумм
lost_card = total_sum - sum_left
print("Номер потерянной карточки:", lost_card)
