## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
# Цикл, который выполнится n-1 раз
while ...:
    card_number = int(input("Номер карточки: "))
    ...

print("Номер потерянной карточки:", ...)
```
#возможно я не правильно понял условия, вообще это задача для списка, если в python такое есть
n = int(input("Количество карточек: "))

i = 1
lost_card = 0
while i < n:
    card_number = int(input("Номер карточки: "))
    if card_number != i:
        lost_card = i
        break
    i += 1

print("Номер потерянной карточки:", lost_card)
