## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

#Потерянная карточка
n = int(input("Количество карточек: "))
count = 0
summa = 0
while count <= n:
    summa += count
    count += 1
print ("Сумма чисел=", summa)
count2 = 1
while count2 <n:
    f = int(input("Карточки в наличии "))
    count2 += 1
    summa -= f
print ("Потерянная карта=", summa)
```
