## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

n = int(input("Количество карточек: "))
# Цикл, который выполнится n-1 раз
index = 1
summ = 0

for num in range (1,n+1):
    summ = summ + num
while index <= n -1:
     summ = summ - int(input("Номер карточки: "))
     index += 1
print("Номер потерянной карточки:", summ)
