## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
i = 1
sum_number_result = 0
sum_all_number = (n+1)*n/2
while i < n:
    card_number = int(input("Номер карточки: "))
    sum_number_result += card_number
    i += 1

print("Номер потерянной карточки:", int(sum_all_number - sum_number_result))

```
