## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
i = 0
sum = 0
while i < n - 1:
    i += 1
    sum_card = 0
for j in range(1, n):
    sum_card += int(input("Номер карточки: "))

for j in range(1, n + 1):
    sum += j

s = sum - sum_card
for j in range(n - 1):
    s = sum - sum_card
print("Номер потерянной карточки:", s)
