## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```n = int(input("Количество карточек:"))
sum_number = (n + 1) * n // 2 #сумма всех номеров карточек
sum = 0
while n != 1:
    card_number = int(input("Номер карточки:"))
    sum += card_number
    n -= 1
print("Номер потерянной карточки:", sum_number - sum)
```
