## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
total_sum = n * (n + 1) // 2  # используем свойство математической прогрессии, сумма чисел от 1 до n равна n*(n+1)/2
cards_sum = 0
i = 0
while i < n-1: # интересный вариант --- "for i in range(n - 1):" ("i = 0" и "i += 1" за аргументировать).

    card_number = int(input("Номер карточки: "))
    cards_sum += card_number
    i += 1
missing_card = total_sum - cards_sum
print("Номер потерянной карточки:", missing_card)
```
