## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
count = 0
control_sum = 0

while count < n-1:
    card_number = int(input("Номер карточки: "))
    control_sum = control_sum + card_number
    count += 1
missed_card = ((1 + n) * n)/2 - control_sum

print("Номер потерянной карточки:", int(missed_card))
```
