## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
a = int(input("a: "))
b = int(input("b: "))

a = int(input("введите число a "))
b = int(input("введите число b "))

if a >= 5 and b >= 5:
    if a < b:
       i = a
       while i <= b:
           if i % 5 == 0:
            print(i)
           i = i + 1
    else:
       i = b
       while i <= a:
         if i % 5 == 0:
          print(i)
         i = i + 1
else:
    print("a или b меньше 5")
```
