## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
n = int(input("Количество карточек: "))
# Цикл, который выполнится n-1 раз
j = n - 1
summ = 0
while j > 0:
    question = "Номер карточки " + str(n-j)+": "
    card_number = int(input(question))
    j -= 1
    summ += card_number
#print("summ", summ)

i = n
check_summ = 0
while i > 0:
    check_summ += i
    i -= 1
#print("check_summ", check_summ)
print("Missed card is: ", check_summ - summ)
```
