## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

```python
carts = int(input("Количество карточек: "))

i = 0
all_summa = (1 + carts) * carts // 2  # Сумма номеров всех карточек
in_stock = 0     # Сумма номеров карточек, которые в наличии
while i < carts - 1:
    in_stock += int(input("Номер карточки: "))
    i += 1
lost = all_summa - in_stock
print("Номер потерянной карточки:", lost)
```
